Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/flexcom.h
/**
 * \brief Component description for FLEXCOM
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-02-20T18:44:00Z */
#ifndef _SAM9X_FLEXCOM_COMPONENT_H_
#define _SAM9X_FLEXCOM_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR FLEXCOM                                      */
/* ************************************************************************** */

/* -------- FLEX_MR : (FLEXCOM Offset: 0x00) (R/W 32) FLEXCOM Mode Register -------- */
#define FLEX_MR_OPMODE_Pos                    _U_(0)                                               /**< (FLEX_MR) FLEXCOM Operating Mode Position */
#define FLEX_MR_OPMODE_Msk                    (_U_(0x3) << FLEX_MR_OPMODE_Pos)                     /**< (FLEX_MR) FLEXCOM Operating Mode Mask */
#define FLEX_MR_OPMODE(value)                 (FLEX_MR_OPMODE_Msk & ((value) << FLEX_MR_OPMODE_Pos))
#define   FLEX_MR_OPMODE_NO_COM_Val           _U_(0x0)                                             /**< (FLEX_MR) No communication  */
#define   FLEX_MR_OPMODE_USART_Val            _U_(0x1)                                             /**< (FLEX_MR) All UART related protocols are selected (RS232, RS485, IrDA, ISO7816, LIN, LON)SPI/TWI related registers are not accessible and have no impact on IOs.  */
#define   FLEX_MR_OPMODE_SPI_Val              _U_(0x2)                                             /**< (FLEX_MR) SPI operating mode is selected.USART/TWI related registers are not accessible and have no impact on IOs.  */
#define   FLEX_MR_OPMODE_TWI_Val              _U_(0x3)                                             /**< (FLEX_MR) All TWI related protocols are selected (TWI, SMBus).USART/SPI related registers are not accessible and have no impact on IOs.  */
#define FLEX_MR_OPMODE_NO_COM                 (FLEX_MR_OPMODE_NO_COM_Val << FLEX_MR_OPMODE_Pos)    /**< (FLEX_MR) No communication Position  */
#define FLEX_MR_OPMODE_USART                  (FLEX_MR_OPMODE_USART_Val << FLEX_MR_OPMODE_Pos)     /**< (FLEX_MR) All UART related protocols are selected (RS232, RS485, IrDA, ISO7816, LIN, LON)SPI/TWI related registers are not accessible and have no impact on IOs. Position  */
#define FLEX_MR_OPMODE_SPI                    (FLEX_MR_OPMODE_SPI_Val << FLEX_MR_OPMODE_Pos)       /**< (FLEX_MR) SPI operating mode is selected.USART/TWI related registers are not accessible and have no impact on IOs. Position  */
#define FLEX_MR_OPMODE_TWI                    (FLEX_MR_OPMODE_TWI_Val << FLEX_MR_OPMODE_Pos)       /**< (FLEX_MR) All TWI related protocols are selected (TWI, SMBus).USART/SPI related registers are not accessible and have no impact on IOs. Position  */
#define FLEX_MR_Msk                           _U_(0x00000003)                                      /**< (FLEX_MR) Register Mask  */


/* -------- FLEX_RHR : (FLEXCOM Offset: 0x10) ( R/ 32) FLEXCOM Receive Holding Register -------- */
#define FLEX_RHR_RXDATA_Pos                   _U_(0)                                               /**< (FLEX_RHR) Receive Data Position */
#define FLEX_RHR_RXDATA_Msk                   (_U_(0xFFFF) << FLEX_RHR_RXDATA_Pos)                 /**< (FLEX_RHR) Receive Data Mask */
#define FLEX_RHR_RXDATA(value)                (FLEX_RHR_RXDATA_Msk & ((value) << FLEX_RHR_RXDATA_Pos))
#define FLEX_RHR_Msk                          _U_(0x0000FFFF)                                      /**< (FLEX_RHR) Register Mask  */


/* -------- FLEX_THR : (FLEXCOM Offset: 0x20) (R/W 32) FLEXCOM Transmit Holding Register -------- */
#define FLEX_THR_TXDATA_Pos                   _U_(0)                                               /**< (FLEX_THR) Transmit Data Position */
#define FLEX_THR_TXDATA_Msk                   (_U_(0xFFFF) << FLEX_THR_TXDATA_Pos)                 /**< (FLEX_THR) Transmit Data Mask */
#define FLEX_THR_TXDATA(value)                (FLEX_THR_TXDATA_Msk & ((value) << FLEX_THR_TXDATA_Pos))
#define FLEX_THR_Msk                          _U_(0x0000FFFF)                                      /**< (FLEX_THR) Register Mask  */


/* -------- FLEX_VERSION : (FLEXCOM Offset: 0xFC) ( R/ 32) FLEXCOM Version Register -------- */
#define FLEX_VERSION_VERSION_Pos              _U_(0)                                               /**< (FLEX_VERSION) Hardware Module Version Position */
#define FLEX_VERSION_VERSION_Msk              (_U_(0xFFF) << FLEX_VERSION_VERSION_Pos)             /**< (FLEX_VERSION) Hardware Module Version Mask */
#define FLEX_VERSION_VERSION(value)           (FLEX_VERSION_VERSION_Msk & ((value) << FLEX_VERSION_VERSION_Pos))
#define FLEX_VERSION_MFN_Pos                  _U_(16)                                              /**< (FLEX_VERSION) Metal Fix Number Position */
#define FLEX_VERSION_MFN_Msk                  (_U_(0x7) << FLEX_VERSION_MFN_Pos)                   /**< (FLEX_VERSION) Metal Fix Number Mask */
#define FLEX_VERSION_MFN(value)               (FLEX_VERSION_MFN_Msk & ((value) << FLEX_VERSION_MFN_Pos))
#define FLEX_VERSION_Msk                      _U_(0x00070FFF)                                      /**< (FLEX_VERSION) Register Mask  */


