Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/flexcom.h
/* -------- FLEX_US_CR : (FLEXCOM Offset: 0x200) ( /W 32) USART Control Register -------- */
#define FLEX_US_CR_RSTRX_Pos                  _U_(2)                                               /**< (FLEX_US_CR) Reset Receiver Position */
#define FLEX_US_CR_RSTRX_Msk                  (_U_(0x1) << FLEX_US_CR_RSTRX_Pos)                   /**< (FLEX_US_CR) Reset Receiver Mask */
#define FLEX_US_CR_RSTRX(value)               (FLEX_US_CR_RSTRX_Msk & ((value) << FLEX_US_CR_RSTRX_Pos))
#define FLEX_US_CR_RSTTX_Pos                  _U_(3)                                               /**< (FLEX_US_CR) Reset Transmitter Position */
#define FLEX_US_CR_RSTTX_Msk                  (_U_(0x1) << FLEX_US_CR_RSTTX_Pos)                   /**< (FLEX_US_CR) Reset Transmitter Mask */
#define FLEX_US_CR_RSTTX(value)               (FLEX_US_CR_RSTTX_Msk & ((value) << FLEX_US_CR_RSTTX_Pos))
#define FLEX_US_CR_RXEN_Pos                   _U_(4)                                               /**< (FLEX_US_CR) Receiver Enable Position */
#define FLEX_US_CR_RXEN_Msk                   (_U_(0x1) << FLEX_US_CR_RXEN_Pos)                    /**< (FLEX_US_CR) Receiver Enable Mask */
#define FLEX_US_CR_RXEN(value)                (FLEX_US_CR_RXEN_Msk & ((value) << FLEX_US_CR_RXEN_Pos))
#define FLEX_US_CR_RXDIS_Pos                  _U_(5)                                               /**< (FLEX_US_CR) Receiver Disable Position */
#define FLEX_US_CR_RXDIS_Msk                  (_U_(0x1) << FLEX_US_CR_RXDIS_Pos)                   /**< (FLEX_US_CR) Receiver Disable Mask */
#define FLEX_US_CR_RXDIS(value)               (FLEX_US_CR_RXDIS_Msk & ((value) << FLEX_US_CR_RXDIS_Pos))
#define FLEX_US_CR_TXEN_Pos                   _U_(6)                                               /**< (FLEX_US_CR) Transmitter Enable Position */
#define FLEX_US_CR_TXEN_Msk                   (_U_(0x1) << FLEX_US_CR_TXEN_Pos)                    /**< (FLEX_US_CR) Transmitter Enable Mask */
#define FLEX_US_CR_TXEN(value)                (FLEX_US_CR_TXEN_Msk & ((value) << FLEX_US_CR_TXEN_Pos))
#define FLEX_US_CR_TXDIS_Pos                  _U_(7)                                               /**< (FLEX_US_CR) Transmitter Disable Position */
#define FLEX_US_CR_TXDIS_Msk                  (_U_(0x1) << FLEX_US_CR_TXDIS_Pos)                   /**< (FLEX_US_CR) Transmitter Disable Mask */
#define FLEX_US_CR_TXDIS(value)               (FLEX_US_CR_TXDIS_Msk & ((value) << FLEX_US_CR_TXDIS_Pos))
#define FLEX_US_CR_RSTSTA_Pos                 _U_(8)                                               /**< (FLEX_US_CR) Reset Status Bits Position */
#define FLEX_US_CR_RSTSTA_Msk                 (_U_(0x1) << FLEX_US_CR_RSTSTA_Pos)                  /**< (FLEX_US_CR) Reset Status Bits Mask */
#define FLEX_US_CR_RSTSTA(value)              (FLEX_US_CR_RSTSTA_Msk & ((value) << FLEX_US_CR_RSTSTA_Pos))
#define FLEX_US_CR_STTBRK_Pos                 _U_(9)                                               /**< (FLEX_US_CR) Start Break Position */
#define FLEX_US_CR_STTBRK_Msk                 (_U_(0x1) << FLEX_US_CR_STTBRK_Pos)                  /**< (FLEX_US_CR) Start Break Mask */
#define FLEX_US_CR_STTBRK(value)              (FLEX_US_CR_STTBRK_Msk & ((value) << FLEX_US_CR_STTBRK_Pos))
#define FLEX_US_CR_STPBRK_Pos                 _U_(10)                                              /**< (FLEX_US_CR) Stop Break Position */
#define FLEX_US_CR_STPBRK_Msk                 (_U_(0x1) << FLEX_US_CR_STPBRK_Pos)                  /**< (FLEX_US_CR) Stop Break Mask */
#define FLEX_US_CR_STPBRK(value)              (FLEX_US_CR_STPBRK_Msk & ((value) << FLEX_US_CR_STPBRK_Pos))
#define FLEX_US_CR_STTTO_Pos                  _U_(11)                                              /**< (FLEX_US_CR) Clear TIMEOUT Flag and Start Timeout After Next Character Received Position */
#define FLEX_US_CR_STTTO_Msk                  (_U_(0x1) << FLEX_US_CR_STTTO_Pos)                   /**< (FLEX_US_CR) Clear TIMEOUT Flag and Start Timeout After Next Character Received Mask */
#define FLEX_US_CR_STTTO(value)               (FLEX_US_CR_STTTO_Msk & ((value) << FLEX_US_CR_STTTO_Pos))
#define FLEX_US_CR_SENDA_Pos                  _U_(12)                                              /**< (FLEX_US_CR) Send Address Position */
#define FLEX_US_CR_SENDA_Msk                  (_U_(0x1) << FLEX_US_CR_SENDA_Pos)                   /**< (FLEX_US_CR) Send Address Mask */
#define FLEX_US_CR_SENDA(value)               (FLEX_US_CR_SENDA_Msk & ((value) << FLEX_US_CR_SENDA_Pos))
#define FLEX_US_CR_RSTIT_Pos                  _U_(13)                                              /**< (FLEX_US_CR) Reset Iterations Position */
#define FLEX_US_CR_RSTIT_Msk                  (_U_(0x1) << FLEX_US_CR_RSTIT_Pos)                   /**< (FLEX_US_CR) Reset Iterations Mask */
#define FLEX_US_CR_RSTIT(value)               (FLEX_US_CR_RSTIT_Msk & ((value) << FLEX_US_CR_RSTIT_Pos))
#define FLEX_US_CR_RSTNACK_Pos                _U_(14)                                              /**< (FLEX_US_CR) Reset Non Acknowledge Position */
#define FLEX_US_CR_RSTNACK_Msk                (_U_(0x1) << FLEX_US_CR_RSTNACK_Pos)                 /**< (FLEX_US_CR) Reset Non Acknowledge Mask */
#define FLEX_US_CR_RSTNACK(value)             (FLEX_US_CR_RSTNACK_Msk & ((value) << FLEX_US_CR_RSTNACK_Pos))
#define FLEX_US_CR_RETTO_Pos                  _U_(15)                                              /**< (FLEX_US_CR) Start Timeout Immediately Position */
#define FLEX_US_CR_RETTO_Msk                  (_U_(0x1) << FLEX_US_CR_RETTO_Pos)                   /**< (FLEX_US_CR) Start Timeout Immediately Mask */
#define FLEX_US_CR_RETTO(value)               (FLEX_US_CR_RETTO_Msk & ((value) << FLEX_US_CR_RETTO_Pos))
#define FLEX_US_CR_DTREN_Pos                  _U_(16)                                              /**< (FLEX_US_CR) Data Terminal Ready Enable Position */
#define FLEX_US_CR_DTREN_Msk                  (_U_(0x1) << FLEX_US_CR_DTREN_Pos)                   /**< (FLEX_US_CR) Data Terminal Ready Enable Mask */
#define FLEX_US_CR_DTREN(value)               (FLEX_US_CR_DTREN_Msk & ((value) << FLEX_US_CR_DTREN_Pos))
#define FLEX_US_CR_DTRDIS_Pos                 _U_(17)                                              /**< (FLEX_US_CR) Data Terminal Ready Disable Position */
#define FLEX_US_CR_DTRDIS_Msk                 (_U_(0x1) << FLEX_US_CR_DTRDIS_Pos)                  /**< (FLEX_US_CR) Data Terminal Ready Disable Mask */
#define FLEX_US_CR_DTRDIS(value)              (FLEX_US_CR_DTRDIS_Msk & ((value) << FLEX_US_CR_DTRDIS_Pos))
#define FLEX_US_CR_RTSEN_Pos                  _U_(18)                                              /**< (FLEX_US_CR) Request to Send Enable Position */
#define FLEX_US_CR_RTSEN_Msk                  (_U_(0x1) << FLEX_US_CR_RTSEN_Pos)                   /**< (FLEX_US_CR) Request to Send Enable Mask */
#define FLEX_US_CR_RTSEN(value)               (FLEX_US_CR_RTSEN_Msk & ((value) << FLEX_US_CR_RTSEN_Pos))
#define FLEX_US_CR_RTSDIS_Pos                 _U_(19)                                              /**< (FLEX_US_CR) Request to Send Disable Position */
#define FLEX_US_CR_RTSDIS_Msk                 (_U_(0x1) << FLEX_US_CR_RTSDIS_Pos)                  /**< (FLEX_US_CR) Request to Send Disable Mask */
#define FLEX_US_CR_RTSDIS(value)              (FLEX_US_CR_RTSDIS_Msk & ((value) << FLEX_US_CR_RTSDIS_Pos))
#define FLEX_US_CR_LINABT_Pos                 _U_(20)                                              /**< (FLEX_US_CR) Abort LIN Transmission Position */
#define FLEX_US_CR_LINABT_Msk                 (_U_(0x1) << FLEX_US_CR_LINABT_Pos)                  /**< (FLEX_US_CR) Abort LIN Transmission Mask */
#define FLEX_US_CR_LINABT(value)              (FLEX_US_CR_LINABT_Msk & ((value) << FLEX_US_CR_LINABT_Pos))
#define FLEX_US_CR_LINWKUP_Pos                _U_(21)                                              /**< (FLEX_US_CR) Send LIN Wakeup Signal Position */
#define FLEX_US_CR_LINWKUP_Msk                (_U_(0x1) << FLEX_US_CR_LINWKUP_Pos)                 /**< (FLEX_US_CR) Send LIN Wakeup Signal Mask */
#define FLEX_US_CR_LINWKUP(value)             (FLEX_US_CR_LINWKUP_Msk & ((value) << FLEX_US_CR_LINWKUP_Pos))
#define FLEX_US_CR_TXFCLR_Pos                 _U_(24)                                              /**< (FLEX_US_CR) Transmit FIFO Clear Position */
#define FLEX_US_CR_TXFCLR_Msk                 (_U_(0x1) << FLEX_US_CR_TXFCLR_Pos)                  /**< (FLEX_US_CR) Transmit FIFO Clear Mask */
#define FLEX_US_CR_TXFCLR(value)              (FLEX_US_CR_TXFCLR_Msk & ((value) << FLEX_US_CR_TXFCLR_Pos))
#define FLEX_US_CR_RXFCLR_Pos                 _U_(25)                                              /**< (FLEX_US_CR) Receive FIFO Clear Position */
#define FLEX_US_CR_RXFCLR_Msk                 (_U_(0x1) << FLEX_US_CR_RXFCLR_Pos)                  /**< (FLEX_US_CR) Receive FIFO Clear Mask */
#define FLEX_US_CR_RXFCLR(value)              (FLEX_US_CR_RXFCLR_Msk & ((value) << FLEX_US_CR_RXFCLR_Pos))
#define FLEX_US_CR_TXFLCLR_Pos                _U_(26)                                              /**< (FLEX_US_CR) Transmit FIFO Lock CLEAR Position */
#define FLEX_US_CR_TXFLCLR_Msk                (_U_(0x1) << FLEX_US_CR_TXFLCLR_Pos)                 /**< (FLEX_US_CR) Transmit FIFO Lock CLEAR Mask */
#define FLEX_US_CR_TXFLCLR(value)             (FLEX_US_CR_TXFLCLR_Msk & ((value) << FLEX_US_CR_TXFLCLR_Pos))
#define FLEX_US_CR_REQCLR_Pos                 _U_(28)                                              /**< (FLEX_US_CR) Request to Clear the Comparison Trigger Position */
#define FLEX_US_CR_REQCLR_Msk                 (_U_(0x1) << FLEX_US_CR_REQCLR_Pos)                  /**< (FLEX_US_CR) Request to Clear the Comparison Trigger Mask */
#define FLEX_US_CR_REQCLR(value)              (FLEX_US_CR_REQCLR_Msk & ((value) << FLEX_US_CR_REQCLR_Pos))
#define FLEX_US_CR_FIFOEN_Pos                 _U_(30)                                              /**< (FLEX_US_CR) FIFO Enable Position */
#define FLEX_US_CR_FIFOEN_Msk                 (_U_(0x1) << FLEX_US_CR_FIFOEN_Pos)                  /**< (FLEX_US_CR) FIFO Enable Mask */
#define FLEX_US_CR_FIFOEN(value)              (FLEX_US_CR_FIFOEN_Msk & ((value) << FLEX_US_CR_FIFOEN_Pos))
#define FLEX_US_CR_FIFODIS_Pos                _U_(31)                                              /**< (FLEX_US_CR) FIFO Disable Position */
#define FLEX_US_CR_FIFODIS_Msk                (_U_(0x1) << FLEX_US_CR_FIFODIS_Pos)                 /**< (FLEX_US_CR) FIFO Disable Mask */
#define FLEX_US_CR_FIFODIS(value)             (FLEX_US_CR_FIFODIS_Msk & ((value) << FLEX_US_CR_FIFODIS_Pos))
#define FLEX_US_CR_Msk                        _U_(0xD73FFFFC)                                      /**< (FLEX_US_CR) Register Mask  */

/* SPI mode */
#define FLEX_US_CR_SPI_Msk                    _U_(0x00000000)                                       /**< (FLEX_US_CR_SPI) Register Mask  */


