Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/flexcom.h
/* LIN mode */
#define FLEX_US_IER_LIN_Msk                   _U_(0x00000000)                                       /**< (FLEX_US_IER_LIN) Register Mask  */

/* LON mode */
#define FLEX_US_IER_LON_Msk                   _U_(0x00000000)                                       /**< (FLEX_US_IER_LON) Register Mask  */


/* -------- FLEX_US_IDR : (FLEXCOM Offset: 0x20C) ( /W 32) USART Interrupt Disable Register -------- */
#define FLEX_US_IDR_RXRDY_Pos                 _U_(0)                                               /**< (FLEX_US_IDR) RXRDY Interrupt Disable Position */
#define FLEX_US_IDR_RXRDY_Msk                 (_U_(0x1) << FLEX_US_IDR_RXRDY_Pos)                  /**< (FLEX_US_IDR) RXRDY Interrupt Disable Mask */
#define FLEX_US_IDR_RXRDY(value)              (FLEX_US_IDR_RXRDY_Msk & ((value) << FLEX_US_IDR_RXRDY_Pos))
#define FLEX_US_IDR_TXRDY_Pos                 _U_(1)                                               /**< (FLEX_US_IDR) TXRDY Interrupt Disable Position */
#define FLEX_US_IDR_TXRDY_Msk                 (_U_(0x1) << FLEX_US_IDR_TXRDY_Pos)                  /**< (FLEX_US_IDR) TXRDY Interrupt Disable Mask */
#define FLEX_US_IDR_TXRDY(value)              (FLEX_US_IDR_TXRDY_Msk & ((value) << FLEX_US_IDR_TXRDY_Pos))
#define FLEX_US_IDR_RXBRK_Pos                 _U_(2)                                               /**< (FLEX_US_IDR) Receiver Break Interrupt Disable Position */
#define FLEX_US_IDR_RXBRK_Msk                 (_U_(0x1) << FLEX_US_IDR_RXBRK_Pos)                  /**< (FLEX_US_IDR) Receiver Break Interrupt Disable Mask */
#define FLEX_US_IDR_RXBRK(value)              (FLEX_US_IDR_RXBRK_Msk & ((value) << FLEX_US_IDR_RXBRK_Pos))
#define FLEX_US_IDR_OVRE_Pos                  _U_(5)                                               /**< (FLEX_US_IDR) Overrun Error Interrupt Enable Position */
#define FLEX_US_IDR_OVRE_Msk                  (_U_(0x1) << FLEX_US_IDR_OVRE_Pos)                   /**< (FLEX_US_IDR) Overrun Error Interrupt Enable Mask */
#define FLEX_US_IDR_OVRE(value)               (FLEX_US_IDR_OVRE_Msk & ((value) << FLEX_US_IDR_OVRE_Pos))
#define FLEX_US_IDR_FRAME_Pos                 _U_(6)                                               /**< (FLEX_US_IDR) Framing Error Interrupt Disable Position */
#define FLEX_US_IDR_FRAME_Msk                 (_U_(0x1) << FLEX_US_IDR_FRAME_Pos)                  /**< (FLEX_US_IDR) Framing Error Interrupt Disable Mask */
#define FLEX_US_IDR_FRAME(value)              (FLEX_US_IDR_FRAME_Msk & ((value) << FLEX_US_IDR_FRAME_Pos))
#define FLEX_US_IDR_PARE_Pos                  _U_(7)                                               /**< (FLEX_US_IDR) Parity Error Interrupt Disable Position */
#define FLEX_US_IDR_PARE_Msk                  (_U_(0x1) << FLEX_US_IDR_PARE_Pos)                   /**< (FLEX_US_IDR) Parity Error Interrupt Disable Mask */
#define FLEX_US_IDR_PARE(value)               (FLEX_US_IDR_PARE_Msk & ((value) << FLEX_US_IDR_PARE_Pos))
#define FLEX_US_IDR_TIMEOUT_Pos               _U_(8)                                               /**< (FLEX_US_IDR) Timeout Interrupt Disable Position */
#define FLEX_US_IDR_TIMEOUT_Msk               (_U_(0x1) << FLEX_US_IDR_TIMEOUT_Pos)                /**< (FLEX_US_IDR) Timeout Interrupt Disable Mask */
#define FLEX_US_IDR_TIMEOUT(value)            (FLEX_US_IDR_TIMEOUT_Msk & ((value) << FLEX_US_IDR_TIMEOUT_Pos))
#define FLEX_US_IDR_TXEMPTY_Pos               _U_(9)                                               /**< (FLEX_US_IDR) TXEMPTY Interrupt Disable Position */
#define FLEX_US_IDR_TXEMPTY_Msk               (_U_(0x1) << FLEX_US_IDR_TXEMPTY_Pos)                /**< (FLEX_US_IDR) TXEMPTY Interrupt Disable Mask */
#define FLEX_US_IDR_TXEMPTY(value)            (FLEX_US_IDR_TXEMPTY_Msk & ((value) << FLEX_US_IDR_TXEMPTY_Pos))
#define FLEX_US_IDR_ITER_Pos                  _U_(10)                                              /**< (FLEX_US_IDR) Max Number of Repetitions Reached Interrupt Disable Position */
#define FLEX_US_IDR_ITER_Msk                  (_U_(0x1) << FLEX_US_IDR_ITER_Pos)                   /**< (FLEX_US_IDR) Max Number of Repetitions Reached Interrupt Disable Mask */
#define FLEX_US_IDR_ITER(value)               (FLEX_US_IDR_ITER_Msk & ((value) << FLEX_US_IDR_ITER_Pos))
#define FLEX_US_IDR_NACK_Pos                  _U_(13)                                              /**< (FLEX_US_IDR) Non Acknowledge Interrupt Disable Position */
#define FLEX_US_IDR_NACK_Msk                  (_U_(0x1) << FLEX_US_IDR_NACK_Pos)                   /**< (FLEX_US_IDR) Non Acknowledge Interrupt Disable Mask */
#define FLEX_US_IDR_NACK(value)               (FLEX_US_IDR_NACK_Msk & ((value) << FLEX_US_IDR_NACK_Pos))
#define FLEX_US_IDR_RIIC_Pos                  _U_(16)                                              /**< (FLEX_US_IDR) Ring Indicator Input Change Disable Position */
#define FLEX_US_IDR_RIIC_Msk                  (_U_(0x1) << FLEX_US_IDR_RIIC_Pos)                   /**< (FLEX_US_IDR) Ring Indicator Input Change Disable Mask */
#define FLEX_US_IDR_RIIC(value)               (FLEX_US_IDR_RIIC_Msk & ((value) << FLEX_US_IDR_RIIC_Pos))
#define FLEX_US_IDR_DSRIC_Pos                 _U_(17)                                              /**< (FLEX_US_IDR) Data Set Ready Input Change Disable Position */
#define FLEX_US_IDR_DSRIC_Msk                 (_U_(0x1) << FLEX_US_IDR_DSRIC_Pos)                  /**< (FLEX_US_IDR) Data Set Ready Input Change Disable Mask */
#define FLEX_US_IDR_DSRIC(value)              (FLEX_US_IDR_DSRIC_Msk & ((value) << FLEX_US_IDR_DSRIC_Pos))
#define FLEX_US_IDR_DCDIC_Pos                 _U_(18)                                              /**< (FLEX_US_IDR) Data Carrier Detect Input Change Interrupt Disable Position */
#define FLEX_US_IDR_DCDIC_Msk                 (_U_(0x1) << FLEX_US_IDR_DCDIC_Pos)                  /**< (FLEX_US_IDR) Data Carrier Detect Input Change Interrupt Disable Mask */
#define FLEX_US_IDR_DCDIC(value)              (FLEX_US_IDR_DCDIC_Msk & ((value) << FLEX_US_IDR_DCDIC_Pos))
#define FLEX_US_IDR_CTSIC_Pos                 _U_(19)                                              /**< (FLEX_US_IDR) Clear to Send Input Change Interrupt Disable Position */
#define FLEX_US_IDR_CTSIC_Msk                 (_U_(0x1) << FLEX_US_IDR_CTSIC_Pos)                  /**< (FLEX_US_IDR) Clear to Send Input Change Interrupt Disable Mask */
#define FLEX_US_IDR_CTSIC(value)              (FLEX_US_IDR_CTSIC_Msk & ((value) << FLEX_US_IDR_CTSIC_Pos))
#define FLEX_US_IDR_CMP_Pos                   _U_(22)                                              /**< (FLEX_US_IDR) Comparison Interrupt Disable Position */
#define FLEX_US_IDR_CMP_Msk                   (_U_(0x1) << FLEX_US_IDR_CMP_Pos)                    /**< (FLEX_US_IDR) Comparison Interrupt Disable Mask */
#define FLEX_US_IDR_CMP(value)                (FLEX_US_IDR_CMP_Msk & ((value) << FLEX_US_IDR_CMP_Pos))
#define FLEX_US_IDR_MANE_Pos                  _U_(24)                                              /**< (FLEX_US_IDR) Manchester Error Interrupt Disable Position */
#define FLEX_US_IDR_MANE_Msk                  (_U_(0x1) << FLEX_US_IDR_MANE_Pos)                   /**< (FLEX_US_IDR) Manchester Error Interrupt Disable Mask */
#define FLEX_US_IDR_MANE(value)               (FLEX_US_IDR_MANE_Msk & ((value) << FLEX_US_IDR_MANE_Pos))
#define FLEX_US_IDR_Msk                       _U_(0x014F27E7)                                      /**< (FLEX_US_IDR) Register Mask  */

/* SPI mode */
#define FLEX_US_IDR_SPI_Msk                   _U_(0x00000000)                                       /**< (FLEX_US_IDR_SPI) Register Mask  */

