Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/flexcom.h
/* LIN mode */
#define FLEX_US_IDR_LIN_Msk                   _U_(0x00000000)                                       /**< (FLEX_US_IDR_LIN) Register Mask  */

/* LON mode */
#define FLEX_US_IDR_LON_Msk                   _U_(0x00000000)                                       /**< (FLEX_US_IDR_LON) Register Mask  */


/* -------- FLEX_US_IMR : (FLEXCOM Offset: 0x210) ( R/ 32) USART Interrupt Mask Register -------- */
#define FLEX_US_IMR_RXRDY_Pos                 _U_(0)                                               /**< (FLEX_US_IMR) RXRDY Interrupt Mask Position */
#define FLEX_US_IMR_RXRDY_Msk                 (_U_(0x1) << FLEX_US_IMR_RXRDY_Pos)                  /**< (FLEX_US_IMR) RXRDY Interrupt Mask Mask */
#define FLEX_US_IMR_RXRDY(value)              (FLEX_US_IMR_RXRDY_Msk & ((value) << FLEX_US_IMR_RXRDY_Pos))
#define FLEX_US_IMR_TXRDY_Pos                 _U_(1)                                               /**< (FLEX_US_IMR) TXRDY Interrupt Mask Position */
#define FLEX_US_IMR_TXRDY_Msk                 (_U_(0x1) << FLEX_US_IMR_TXRDY_Pos)                  /**< (FLEX_US_IMR) TXRDY Interrupt Mask Mask */
#define FLEX_US_IMR_TXRDY(value)              (FLEX_US_IMR_TXRDY_Msk & ((value) << FLEX_US_IMR_TXRDY_Pos))
#define FLEX_US_IMR_RXBRK_Pos                 _U_(2)                                               /**< (FLEX_US_IMR) Receiver Break Interrupt Mask Position */
#define FLEX_US_IMR_RXBRK_Msk                 (_U_(0x1) << FLEX_US_IMR_RXBRK_Pos)                  /**< (FLEX_US_IMR) Receiver Break Interrupt Mask Mask */
#define FLEX_US_IMR_RXBRK(value)              (FLEX_US_IMR_RXBRK_Msk & ((value) << FLEX_US_IMR_RXBRK_Pos))
#define FLEX_US_IMR_OVRE_Pos                  _U_(5)                                               /**< (FLEX_US_IMR) Overrun Error Interrupt Mask Position */
#define FLEX_US_IMR_OVRE_Msk                  (_U_(0x1) << FLEX_US_IMR_OVRE_Pos)                   /**< (FLEX_US_IMR) Overrun Error Interrupt Mask Mask */
#define FLEX_US_IMR_OVRE(value)               (FLEX_US_IMR_OVRE_Msk & ((value) << FLEX_US_IMR_OVRE_Pos))
#define FLEX_US_IMR_FRAME_Pos                 _U_(6)                                               /**< (FLEX_US_IMR) Framing Error Interrupt Mask Position */
#define FLEX_US_IMR_FRAME_Msk                 (_U_(0x1) << FLEX_US_IMR_FRAME_Pos)                  /**< (FLEX_US_IMR) Framing Error Interrupt Mask Mask */
#define FLEX_US_IMR_FRAME(value)              (FLEX_US_IMR_FRAME_Msk & ((value) << FLEX_US_IMR_FRAME_Pos))
#define FLEX_US_IMR_PARE_Pos                  _U_(7)                                               /**< (FLEX_US_IMR) Parity Error Interrupt Mask Position */
#define FLEX_US_IMR_PARE_Msk                  (_U_(0x1) << FLEX_US_IMR_PARE_Pos)                   /**< (FLEX_US_IMR) Parity Error Interrupt Mask Mask */
#define FLEX_US_IMR_PARE(value)               (FLEX_US_IMR_PARE_Msk & ((value) << FLEX_US_IMR_PARE_Pos))
#define FLEX_US_IMR_TIMEOUT_Pos               _U_(8)                                               /**< (FLEX_US_IMR) Timeout Interrupt Mask Position */
#define FLEX_US_IMR_TIMEOUT_Msk               (_U_(0x1) << FLEX_US_IMR_TIMEOUT_Pos)                /**< (FLEX_US_IMR) Timeout Interrupt Mask Mask */
#define FLEX_US_IMR_TIMEOUT(value)            (FLEX_US_IMR_TIMEOUT_Msk & ((value) << FLEX_US_IMR_TIMEOUT_Pos))
#define FLEX_US_IMR_TXEMPTY_Pos               _U_(9)                                               /**< (FLEX_US_IMR) TXEMPTY Interrupt Mask Position */
#define FLEX_US_IMR_TXEMPTY_Msk               (_U_(0x1) << FLEX_US_IMR_TXEMPTY_Pos)                /**< (FLEX_US_IMR) TXEMPTY Interrupt Mask Mask */
#define FLEX_US_IMR_TXEMPTY(value)            (FLEX_US_IMR_TXEMPTY_Msk & ((value) << FLEX_US_IMR_TXEMPTY_Pos))
#define FLEX_US_IMR_ITER_Pos                  _U_(10)                                              /**< (FLEX_US_IMR) Max Number of Repetitions Reached Interrupt Mask Position */
#define FLEX_US_IMR_ITER_Msk                  (_U_(0x1) << FLEX_US_IMR_ITER_Pos)                   /**< (FLEX_US_IMR) Max Number of Repetitions Reached Interrupt Mask Mask */
#define FLEX_US_IMR_ITER(value)               (FLEX_US_IMR_ITER_Msk & ((value) << FLEX_US_IMR_ITER_Pos))
#define FLEX_US_IMR_NACK_Pos                  _U_(13)                                              /**< (FLEX_US_IMR) Non Acknowledge Interrupt Mask Position */
#define FLEX_US_IMR_NACK_Msk                  (_U_(0x1) << FLEX_US_IMR_NACK_Pos)                   /**< (FLEX_US_IMR) Non Acknowledge Interrupt Mask Mask */
#define FLEX_US_IMR_NACK(value)               (FLEX_US_IMR_NACK_Msk & ((value) << FLEX_US_IMR_NACK_Pos))
#define FLEX_US_IMR_RIIC_Pos                  _U_(16)                                              /**< (FLEX_US_IMR) Ring Indicator Input Change Mask Position */
#define FLEX_US_IMR_RIIC_Msk                  (_U_(0x1) << FLEX_US_IMR_RIIC_Pos)                   /**< (FLEX_US_IMR) Ring Indicator Input Change Mask Mask */
#define FLEX_US_IMR_RIIC(value)               (FLEX_US_IMR_RIIC_Msk & ((value) << FLEX_US_IMR_RIIC_Pos))
#define FLEX_US_IMR_DSRIC_Pos                 _U_(17)                                              /**< (FLEX_US_IMR) Data Set Ready Input Change Mask Position */
#define FLEX_US_IMR_DSRIC_Msk                 (_U_(0x1) << FLEX_US_IMR_DSRIC_Pos)                  /**< (FLEX_US_IMR) Data Set Ready Input Change Mask Mask */
#define FLEX_US_IMR_DSRIC(value)              (FLEX_US_IMR_DSRIC_Msk & ((value) << FLEX_US_IMR_DSRIC_Pos))
#define FLEX_US_IMR_DCDIC_Pos                 _U_(18)                                              /**< (FLEX_US_IMR) Data Carrier Detect Input Change Interrupt Mask Position */
#define FLEX_US_IMR_DCDIC_Msk                 (_U_(0x1) << FLEX_US_IMR_DCDIC_Pos)                  /**< (FLEX_US_IMR) Data Carrier Detect Input Change Interrupt Mask Mask */
#define FLEX_US_IMR_DCDIC(value)              (FLEX_US_IMR_DCDIC_Msk & ((value) << FLEX_US_IMR_DCDIC_Pos))
#define FLEX_US_IMR_CTSIC_Pos                 _U_(19)                                              /**< (FLEX_US_IMR) Clear to Send Input Change Interrupt Mask Position */
#define FLEX_US_IMR_CTSIC_Msk                 (_U_(0x1) << FLEX_US_IMR_CTSIC_Pos)                  /**< (FLEX_US_IMR) Clear to Send Input Change Interrupt Mask Mask */
#define FLEX_US_IMR_CTSIC(value)              (FLEX_US_IMR_CTSIC_Msk & ((value) << FLEX_US_IMR_CTSIC_Pos))
#define FLEX_US_IMR_CMP_Pos                   _U_(22)                                              /**< (FLEX_US_IMR) Comparison Interrupt Mask Position */
#define FLEX_US_IMR_CMP_Msk                   (_U_(0x1) << FLEX_US_IMR_CMP_Pos)                    /**< (FLEX_US_IMR) Comparison Interrupt Mask Mask */
#define FLEX_US_IMR_CMP(value)                (FLEX_US_IMR_CMP_Msk & ((value) << FLEX_US_IMR_CMP_Pos))
#define FLEX_US_IMR_MANE_Pos                  _U_(24)                                              /**< (FLEX_US_IMR) Manchester Error Interrupt Mask Position */
#define FLEX_US_IMR_MANE_Msk                  (_U_(0x1) << FLEX_US_IMR_MANE_Pos)                   /**< (FLEX_US_IMR) Manchester Error Interrupt Mask Mask */
#define FLEX_US_IMR_MANE(value)               (FLEX_US_IMR_MANE_Msk & ((value) << FLEX_US_IMR_MANE_Pos))
#define FLEX_US_IMR_Msk                       _U_(0x014F27E7)                                      /**< (FLEX_US_IMR) Register Mask  */

/* SPI mode */
#define FLEX_US_IMR_SPI_Msk                   _U_(0x00000000)                                       /**< (FLEX_US_IMR_SPI) Register Mask  */

