Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/flexcom.h
/* LIN mode */
#define FLEX_US_IMR_LIN_Msk                   _U_(0x00000000)                                       /**< (FLEX_US_IMR_LIN) Register Mask  */

/* LON mode */
#define FLEX_US_IMR_LON_Msk                   _U_(0x00000000)                                       /**< (FLEX_US_IMR_LON) Register Mask  */


/* -------- FLEX_US_CSR : (FLEXCOM Offset: 0x214) ( R/ 32) USART Channel Status Register -------- */
#define FLEX_US_CSR_RXRDY_Pos                 _U_(0)                                               /**< (FLEX_US_CSR) Receiver Ready (cleared by reading FLEX_US_RHR) Position */
#define FLEX_US_CSR_RXRDY_Msk                 (_U_(0x1) << FLEX_US_CSR_RXRDY_Pos)                  /**< (FLEX_US_CSR) Receiver Ready (cleared by reading FLEX_US_RHR) Mask */
#define FLEX_US_CSR_RXRDY(value)              (FLEX_US_CSR_RXRDY_Msk & ((value) << FLEX_US_CSR_RXRDY_Pos))
#define FLEX_US_CSR_TXRDY_Pos                 _U_(1)                                               /**< (FLEX_US_CSR) Transmitter Ready (cleared by writing FLEX_US_THR) Position */
#define FLEX_US_CSR_TXRDY_Msk                 (_U_(0x1) << FLEX_US_CSR_TXRDY_Pos)                  /**< (FLEX_US_CSR) Transmitter Ready (cleared by writing FLEX_US_THR) Mask */
#define FLEX_US_CSR_TXRDY(value)              (FLEX_US_CSR_TXRDY_Msk & ((value) << FLEX_US_CSR_TXRDY_Pos))
#define FLEX_US_CSR_RXBRK_Pos                 _U_(2)                                               /**< (FLEX_US_CSR) Break Received/End of Break Position */
#define FLEX_US_CSR_RXBRK_Msk                 (_U_(0x1) << FLEX_US_CSR_RXBRK_Pos)                  /**< (FLEX_US_CSR) Break Received/End of Break Mask */
#define FLEX_US_CSR_RXBRK(value)              (FLEX_US_CSR_RXBRK_Msk & ((value) << FLEX_US_CSR_RXBRK_Pos))
#define FLEX_US_CSR_OVRE_Pos                  _U_(5)                                               /**< (FLEX_US_CSR) Overrun Error Position */
#define FLEX_US_CSR_OVRE_Msk                  (_U_(0x1) << FLEX_US_CSR_OVRE_Pos)                   /**< (FLEX_US_CSR) Overrun Error Mask */
#define FLEX_US_CSR_OVRE(value)               (FLEX_US_CSR_OVRE_Msk & ((value) << FLEX_US_CSR_OVRE_Pos))
#define FLEX_US_CSR_FRAME_Pos                 _U_(6)                                               /**< (FLEX_US_CSR) Framing Error Position */
#define FLEX_US_CSR_FRAME_Msk                 (_U_(0x1) << FLEX_US_CSR_FRAME_Pos)                  /**< (FLEX_US_CSR) Framing Error Mask */
#define FLEX_US_CSR_FRAME(value)              (FLEX_US_CSR_FRAME_Msk & ((value) << FLEX_US_CSR_FRAME_Pos))
#define FLEX_US_CSR_PARE_Pos                  _U_(7)                                               /**< (FLEX_US_CSR) Parity Error Position */
#define FLEX_US_CSR_PARE_Msk                  (_U_(0x1) << FLEX_US_CSR_PARE_Pos)                   /**< (FLEX_US_CSR) Parity Error Mask */
#define FLEX_US_CSR_PARE(value)               (FLEX_US_CSR_PARE_Msk & ((value) << FLEX_US_CSR_PARE_Pos))
#define FLEX_US_CSR_TIMEOUT_Pos               _U_(8)                                               /**< (FLEX_US_CSR) Receiver Timeout Position */
#define FLEX_US_CSR_TIMEOUT_Msk               (_U_(0x1) << FLEX_US_CSR_TIMEOUT_Pos)                /**< (FLEX_US_CSR) Receiver Timeout Mask */
#define FLEX_US_CSR_TIMEOUT(value)            (FLEX_US_CSR_TIMEOUT_Msk & ((value) << FLEX_US_CSR_TIMEOUT_Pos))
#define FLEX_US_CSR_TXEMPTY_Pos               _U_(9)                                               /**< (FLEX_US_CSR) Transmitter Empty (cleared by writing FLEX_US_THR) Position */
#define FLEX_US_CSR_TXEMPTY_Msk               (_U_(0x1) << FLEX_US_CSR_TXEMPTY_Pos)                /**< (FLEX_US_CSR) Transmitter Empty (cleared by writing FLEX_US_THR) Mask */
#define FLEX_US_CSR_TXEMPTY(value)            (FLEX_US_CSR_TXEMPTY_Msk & ((value) << FLEX_US_CSR_TXEMPTY_Pos))
#define FLEX_US_CSR_ITER_Pos                  _U_(10)                                              /**< (FLEX_US_CSR) Max Number of Repetitions Reached Position */
#define FLEX_US_CSR_ITER_Msk                  (_U_(0x1) << FLEX_US_CSR_ITER_Pos)                   /**< (FLEX_US_CSR) Max Number of Repetitions Reached Mask */
#define FLEX_US_CSR_ITER(value)               (FLEX_US_CSR_ITER_Msk & ((value) << FLEX_US_CSR_ITER_Pos))
#define FLEX_US_CSR_NACK_Pos                  _U_(13)                                              /**< (FLEX_US_CSR) Non Acknowledge Interrupt Position */
#define FLEX_US_CSR_NACK_Msk                  (_U_(0x1) << FLEX_US_CSR_NACK_Pos)                   /**< (FLEX_US_CSR) Non Acknowledge Interrupt Mask */
#define FLEX_US_CSR_NACK(value)               (FLEX_US_CSR_NACK_Msk & ((value) << FLEX_US_CSR_NACK_Pos))
#define FLEX_US_CSR_RIIC_Pos                  _U_(16)                                              /**< (FLEX_US_CSR) Ring Indicator Input Change Flag Position */
#define FLEX_US_CSR_RIIC_Msk                  (_U_(0x1) << FLEX_US_CSR_RIIC_Pos)                   /**< (FLEX_US_CSR) Ring Indicator Input Change Flag Mask */
#define FLEX_US_CSR_RIIC(value)               (FLEX_US_CSR_RIIC_Msk & ((value) << FLEX_US_CSR_RIIC_Pos))
#define FLEX_US_CSR_DSRIC_Pos                 _U_(17)                                              /**< (FLEX_US_CSR) Data Set Ready Input Change Flag Position */
#define FLEX_US_CSR_DSRIC_Msk                 (_U_(0x1) << FLEX_US_CSR_DSRIC_Pos)                  /**< (FLEX_US_CSR) Data Set Ready Input Change Flag Mask */
#define FLEX_US_CSR_DSRIC(value)              (FLEX_US_CSR_DSRIC_Msk & ((value) << FLEX_US_CSR_DSRIC_Pos))
#define FLEX_US_CSR_DCDIC_Pos                 _U_(18)                                              /**< (FLEX_US_CSR) Data Carrier Detect Input Change Flag Position */
#define FLEX_US_CSR_DCDIC_Msk                 (_U_(0x1) << FLEX_US_CSR_DCDIC_Pos)                  /**< (FLEX_US_CSR) Data Carrier Detect Input Change Flag Mask */
#define FLEX_US_CSR_DCDIC(value)              (FLEX_US_CSR_DCDIC_Msk & ((value) << FLEX_US_CSR_DCDIC_Pos))
#define FLEX_US_CSR_CTSIC_Pos                 _U_(19)                                              /**< (FLEX_US_CSR) Clear to Send Input Change Flag Position */
#define FLEX_US_CSR_CTSIC_Msk                 (_U_(0x1) << FLEX_US_CSR_CTSIC_Pos)                  /**< (FLEX_US_CSR) Clear to Send Input Change Flag Mask */
#define FLEX_US_CSR_CTSIC(value)              (FLEX_US_CSR_CTSIC_Msk & ((value) << FLEX_US_CSR_CTSIC_Pos))
#define FLEX_US_CSR_CMP_Pos                   _U_(22)                                              /**< (FLEX_US_CSR) Comparison Status Position */
#define FLEX_US_CSR_CMP_Msk                   (_U_(0x1) << FLEX_US_CSR_CMP_Pos)                    /**< (FLEX_US_CSR) Comparison Status Mask */
#define FLEX_US_CSR_CMP(value)                (FLEX_US_CSR_CMP_Msk & ((value) << FLEX_US_CSR_CMP_Pos))
#define FLEX_US_CSR_CTS_Pos                   _U_(23)                                              /**< (FLEX_US_CSR) Image of CTS Input Position */
#define FLEX_US_CSR_CTS_Msk                   (_U_(0x1) << FLEX_US_CSR_CTS_Pos)                    /**< (FLEX_US_CSR) Image of CTS Input Mask */
#define FLEX_US_CSR_CTS(value)                (FLEX_US_CSR_CTS_Msk & ((value) << FLEX_US_CSR_CTS_Pos))
#define FLEX_US_CSR_MANE_Pos                  _U_(24)                                              /**< (FLEX_US_CSR) Manchester Error Position */
#define FLEX_US_CSR_MANE_Msk                  (_U_(0x1) << FLEX_US_CSR_MANE_Pos)                   /**< (FLEX_US_CSR) Manchester Error Mask */
#define FLEX_US_CSR_MANE(value)               (FLEX_US_CSR_MANE_Msk & ((value) << FLEX_US_CSR_MANE_Pos))
#define FLEX_US_CSR_Msk                       _U_(0x01CF27E7)                                      /**< (FLEX_US_CSR) Register Mask  */

/* SPI mode */
#define FLEX_US_CSR_SPI_Msk                   _U_(0x00000000)                                       /**< (FLEX_US_CSR_SPI) Register Mask  */

