Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/flexcom.h
/* -------- FLEX_US_LINBRR : (FLEXCOM Offset: 0x25C) ( R/ 32) USART LIN Baud Rate Register -------- */
#define FLEX_US_LINBRR_LINCD_Pos              _U_(0)                                               /**< (FLEX_US_LINBRR) Clock Divider after Synchronization Position */
#define FLEX_US_LINBRR_LINCD_Msk              (_U_(0xFFFF) << FLEX_US_LINBRR_LINCD_Pos)            /**< (FLEX_US_LINBRR) Clock Divider after Synchronization Mask */
#define FLEX_US_LINBRR_LINCD(value)           (FLEX_US_LINBRR_LINCD_Msk & ((value) << FLEX_US_LINBRR_LINCD_Pos))
#define FLEX_US_LINBRR_LINFP_Pos              _U_(16)                                              /**< (FLEX_US_LINBRR) Fractional Part after Synchronization Position */
#define FLEX_US_LINBRR_LINFP_Msk              (_U_(0x7) << FLEX_US_LINBRR_LINFP_Pos)               /**< (FLEX_US_LINBRR) Fractional Part after Synchronization Mask */
#define FLEX_US_LINBRR_LINFP(value)           (FLEX_US_LINBRR_LINFP_Msk & ((value) << FLEX_US_LINBRR_LINFP_Pos))
#define FLEX_US_LINBRR_Msk                    _U_(0x0007FFFF)                                      /**< (FLEX_US_LINBRR) Register Mask  */


/* -------- FLEX_US_LONMR : (FLEXCOM Offset: 0x260) (R/W 32) USART LON Mode Register -------- */
#define FLEX_US_LONMR_COMMT_Pos               _U_(0)                                               /**< (FLEX_US_LONMR) LON comm_type Parameter Value Position */
#define FLEX_US_LONMR_COMMT_Msk               (_U_(0x1) << FLEX_US_LONMR_COMMT_Pos)                /**< (FLEX_US_LONMR) LON comm_type Parameter Value Mask */
#define FLEX_US_LONMR_COMMT(value)            (FLEX_US_LONMR_COMMT_Msk & ((value) << FLEX_US_LONMR_COMMT_Pos))
#define FLEX_US_LONMR_COLDET_Pos              _U_(1)                                               /**< (FLEX_US_LONMR) LON Collision Detection Feature Position */
#define FLEX_US_LONMR_COLDET_Msk              (_U_(0x1) << FLEX_US_LONMR_COLDET_Pos)               /**< (FLEX_US_LONMR) LON Collision Detection Feature Mask */
#define FLEX_US_LONMR_COLDET(value)           (FLEX_US_LONMR_COLDET_Msk & ((value) << FLEX_US_LONMR_COLDET_Pos))
#define FLEX_US_LONMR_TCOL_Pos                _U_(2)                                               /**< (FLEX_US_LONMR) Terminate Frame upon Collision Notification Position */
#define FLEX_US_LONMR_TCOL_Msk                (_U_(0x1) << FLEX_US_LONMR_TCOL_Pos)                 /**< (FLEX_US_LONMR) Terminate Frame upon Collision Notification Mask */
#define FLEX_US_LONMR_TCOL(value)             (FLEX_US_LONMR_TCOL_Msk & ((value) << FLEX_US_LONMR_TCOL_Pos))
#define FLEX_US_LONMR_CDTAIL_Pos              _U_(3)                                               /**< (FLEX_US_LONMR) LON Collision Detection on Frame Tail Position */
#define FLEX_US_LONMR_CDTAIL_Msk              (_U_(0x1) << FLEX_US_LONMR_CDTAIL_Pos)               /**< (FLEX_US_LONMR) LON Collision Detection on Frame Tail Mask */
#define FLEX_US_LONMR_CDTAIL(value)           (FLEX_US_LONMR_CDTAIL_Msk & ((value) << FLEX_US_LONMR_CDTAIL_Pos))
#define FLEX_US_LONMR_DMAM_Pos                _U_(4)                                               /**< (FLEX_US_LONMR) LON DMA Mode Position */
#define FLEX_US_LONMR_DMAM_Msk                (_U_(0x1) << FLEX_US_LONMR_DMAM_Pos)                 /**< (FLEX_US_LONMR) LON DMA Mode Mask */
#define FLEX_US_LONMR_DMAM(value)             (FLEX_US_LONMR_DMAM_Msk & ((value) << FLEX_US_LONMR_DMAM_Pos))
#define FLEX_US_LONMR_LCDS_Pos                _U_(5)                                               /**< (FLEX_US_LONMR) LON Collision Detection Source Position */
#define FLEX_US_LONMR_LCDS_Msk                (_U_(0x1) << FLEX_US_LONMR_LCDS_Pos)                 /**< (FLEX_US_LONMR) LON Collision Detection Source Mask */
#define FLEX_US_LONMR_LCDS(value)             (FLEX_US_LONMR_LCDS_Msk & ((value) << FLEX_US_LONMR_LCDS_Pos))
#define FLEX_US_LONMR_EOFS_Pos                _U_(16)                                              /**< (FLEX_US_LONMR) End of Frame Condition Size Position */
#define FLEX_US_LONMR_EOFS_Msk                (_U_(0xFF) << FLEX_US_LONMR_EOFS_Pos)                /**< (FLEX_US_LONMR) End of Frame Condition Size Mask */
#define FLEX_US_LONMR_EOFS(value)             (FLEX_US_LONMR_EOFS_Msk & ((value) << FLEX_US_LONMR_EOFS_Pos))
#define FLEX_US_LONMR_Msk                     _U_(0x00FF003F)                                      /**< (FLEX_US_LONMR) Register Mask  */


/* -------- FLEX_US_LONPR : (FLEXCOM Offset: 0x264) (R/W 32) USART LON Preamble Register -------- */
#define FLEX_US_LONPR_LONPL_Pos               _U_(0)                                               /**< (FLEX_US_LONPR) LON Preamble Length Position */
#define FLEX_US_LONPR_LONPL_Msk               (_U_(0x3FFF) << FLEX_US_LONPR_LONPL_Pos)             /**< (FLEX_US_LONPR) LON Preamble Length Mask */
#define FLEX_US_LONPR_LONPL(value)            (FLEX_US_LONPR_LONPL_Msk & ((value) << FLEX_US_LONPR_LONPL_Pos))
#define FLEX_US_LONPR_Msk                     _U_(0x00003FFF)                                      /**< (FLEX_US_LONPR) Register Mask  */


/* -------- FLEX_US_LONDL : (FLEXCOM Offset: 0x268) (R/W 32) USART LON Data Length Register -------- */
#define FLEX_US_LONDL_LONDL_Pos               _U_(0)                                               /**< (FLEX_US_LONDL) LON Data Length Position */
#define FLEX_US_LONDL_LONDL_Msk               (_U_(0xFF) << FLEX_US_LONDL_LONDL_Pos)               /**< (FLEX_US_LONDL) LON Data Length Mask */
#define FLEX_US_LONDL_LONDL(value)            (FLEX_US_LONDL_LONDL_Msk & ((value) << FLEX_US_LONDL_LONDL_Pos))
#define FLEX_US_LONDL_Msk                     _U_(0x000000FF)                                      /**< (FLEX_US_LONDL) Register Mask  */


/* -------- FLEX_US_LONL2HDR : (FLEXCOM Offset: 0x26C) (R/W 32) USART LON L2HDR Register -------- */
#define FLEX_US_LONL2HDR_BLI_Pos              _U_(0)                                               /**< (FLEX_US_LONL2HDR) LON Backlog Increment Position */
#define FLEX_US_LONL2HDR_BLI_Msk              (_U_(0x3F) << FLEX_US_LONL2HDR_BLI_Pos)              /**< (FLEX_US_LONL2HDR) LON Backlog Increment Mask */
#define FLEX_US_LONL2HDR_BLI(value)           (FLEX_US_LONL2HDR_BLI_Msk & ((value) << FLEX_US_LONL2HDR_BLI_Pos))
#define FLEX_US_LONL2HDR_ALTP_Pos             _U_(6)                                               /**< (FLEX_US_LONL2HDR) LON Alternate Path Bit Position */
#define FLEX_US_LONL2HDR_ALTP_Msk             (_U_(0x1) << FLEX_US_LONL2HDR_ALTP_Pos)              /**< (FLEX_US_LONL2HDR) LON Alternate Path Bit Mask */
#define FLEX_US_LONL2HDR_ALTP(value)          (FLEX_US_LONL2HDR_ALTP_Msk & ((value) << FLEX_US_LONL2HDR_ALTP_Pos))
#define FLEX_US_LONL2HDR_PB_Pos               _U_(7)                                               /**< (FLEX_US_LONL2HDR) LON Priority Bit Position */
#define FLEX_US_LONL2HDR_PB_Msk               (_U_(0x1) << FLEX_US_LONL2HDR_PB_Pos)                /**< (FLEX_US_LONL2HDR) LON Priority Bit Mask */
#define FLEX_US_LONL2HDR_PB(value)            (FLEX_US_LONL2HDR_PB_Msk & ((value) << FLEX_US_LONL2HDR_PB_Pos))
#define FLEX_US_LONL2HDR_Msk                  _U_(0x000000FF)                                      /**< (FLEX_US_LONL2HDR) Register Mask  */


/* -------- FLEX_US_LONBL : (FLEXCOM Offset: 0x270) ( R/ 32) USART LON Backlog Register -------- */
#define FLEX_US_LONBL_LONBL_Pos               _U_(0)                                               /**< (FLEX_US_LONBL) LON Node Backlog Value Position */
#define FLEX_US_LONBL_LONBL_Msk               (_U_(0x3F) << FLEX_US_LONBL_LONBL_Pos)               /**< (FLEX_US_LONBL) LON Node Backlog Value Mask */
#define FLEX_US_LONBL_LONBL(value)            (FLEX_US_LONBL_LONBL_Msk & ((value) << FLEX_US_LONBL_LONBL_Pos))
#define FLEX_US_LONBL_Msk                     _U_(0x0000003F)                                      /**< (FLEX_US_LONBL) Register Mask  */


/* -------- FLEX_US_LONB1TX : (FLEXCOM Offset: 0x274) (R/W 32) USART LON Beta1 Tx Register -------- */
#define FLEX_US_LONB1TX_BETA1TX_Pos           _U_(0)                                               /**< (FLEX_US_LONB1TX) LON Beta1 Length after Transmission Position */
#define FLEX_US_LONB1TX_BETA1TX_Msk           (_U_(0xFFFFFF) << FLEX_US_LONB1TX_BETA1TX_Pos)       /**< (FLEX_US_LONB1TX) LON Beta1 Length after Transmission Mask */
#define FLEX_US_LONB1TX_BETA1TX(value)        (FLEX_US_LONB1TX_BETA1TX_Msk & ((value) << FLEX_US_LONB1TX_BETA1TX_Pos))
#define FLEX_US_LONB1TX_Msk                   _U_(0x00FFFFFF)                                      /**< (FLEX_US_LONB1TX) Register Mask  */


/* -------- FLEX_US_LONB1RX : (FLEXCOM Offset: 0x278) (R/W 32) USART LON Beta1 Rx Register -------- */
#define FLEX_US_LONB1RX_BETA1RX_Pos           _U_(0)                                               /**< (FLEX_US_LONB1RX) LON Beta1 Length after Reception Position */
#define FLEX_US_LONB1RX_BETA1RX_Msk           (_U_(0xFFFFFF) << FLEX_US_LONB1RX_BETA1RX_Pos)       /**< (FLEX_US_LONB1RX) LON Beta1 Length after Reception Mask */
#define FLEX_US_LONB1RX_BETA1RX(value)        (FLEX_US_LONB1RX_BETA1RX_Msk & ((value) << FLEX_US_LONB1RX_BETA1RX_Pos))
#define FLEX_US_LONB1RX_Msk                   _U_(0x00FFFFFF)                                      /**< (FLEX_US_LONB1RX) Register Mask  */


