Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/flexcom.h
/* -------- FLEX_US_WPSR : (FLEXCOM Offset: 0x2E8) ( R/ 32) USART Write Protection Status Register -------- */
#define FLEX_US_WPSR_WPVS_Pos                 _U_(0)                                               /**< (FLEX_US_WPSR) Write Protection Violation Status Position */
#define FLEX_US_WPSR_WPVS_Msk                 (_U_(0x1) << FLEX_US_WPSR_WPVS_Pos)                  /**< (FLEX_US_WPSR) Write Protection Violation Status Mask */
#define FLEX_US_WPSR_WPVS(value)              (FLEX_US_WPSR_WPVS_Msk & ((value) << FLEX_US_WPSR_WPVS_Pos))
#define FLEX_US_WPSR_WPVSRC_Pos               _U_(8)                                               /**< (FLEX_US_WPSR) Write Protection Violation Source Position */
#define FLEX_US_WPSR_WPVSRC_Msk               (_U_(0xFFFF) << FLEX_US_WPSR_WPVSRC_Pos)             /**< (FLEX_US_WPSR) Write Protection Violation Source Mask */
#define FLEX_US_WPSR_WPVSRC(value)            (FLEX_US_WPSR_WPVSRC_Msk & ((value) << FLEX_US_WPSR_WPVSRC_Pos))
#define FLEX_US_WPSR_Msk                      _U_(0x00FFFF01)                                      /**< (FLEX_US_WPSR) Register Mask  */


/* -------- FLEX_US_VERSION : (FLEXCOM Offset: 0x2FC) ( R/ 32) USART Version Register -------- */
#define FLEX_US_VERSION_VERSION_Pos           _U_(0)                                               /**< (FLEX_US_VERSION) Hardware Module Version Position */
#define FLEX_US_VERSION_VERSION_Msk           (_U_(0xFFF) << FLEX_US_VERSION_VERSION_Pos)          /**< (FLEX_US_VERSION) Hardware Module Version Mask */
#define FLEX_US_VERSION_VERSION(value)        (FLEX_US_VERSION_VERSION_Msk & ((value) << FLEX_US_VERSION_VERSION_Pos))
#define FLEX_US_VERSION_MFN_Pos               _U_(16)                                              /**< (FLEX_US_VERSION) Metal Fix Number Position */
#define FLEX_US_VERSION_MFN_Msk               (_U_(0x7) << FLEX_US_VERSION_MFN_Pos)                /**< (FLEX_US_VERSION) Metal Fix Number Mask */
#define FLEX_US_VERSION_MFN(value)            (FLEX_US_VERSION_MFN_Msk & ((value) << FLEX_US_VERSION_MFN_Pos))
#define FLEX_US_VERSION_Msk                   _U_(0x00070FFF)                                      /**< (FLEX_US_VERSION) Register Mask  */


/* -------- FLEX_SPI_CR : (FLEXCOM Offset: 0x400) ( /W 32) SPI Control Register -------- */
#define FLEX_SPI_CR_SPIEN_Pos                 _U_(0)                                               /**< (FLEX_SPI_CR) SPI Enable Position */
#define FLEX_SPI_CR_SPIEN_Msk                 (_U_(0x1) << FLEX_SPI_CR_SPIEN_Pos)                  /**< (FLEX_SPI_CR) SPI Enable Mask */
#define FLEX_SPI_CR_SPIEN(value)              (FLEX_SPI_CR_SPIEN_Msk & ((value) << FLEX_SPI_CR_SPIEN_Pos))
#define FLEX_SPI_CR_SPIDIS_Pos                _U_(1)                                               /**< (FLEX_SPI_CR) SPI Disable Position */
#define FLEX_SPI_CR_SPIDIS_Msk                (_U_(0x1) << FLEX_SPI_CR_SPIDIS_Pos)                 /**< (FLEX_SPI_CR) SPI Disable Mask */
#define FLEX_SPI_CR_SPIDIS(value)             (FLEX_SPI_CR_SPIDIS_Msk & ((value) << FLEX_SPI_CR_SPIDIS_Pos))
#define FLEX_SPI_CR_SWRST_Pos                 _U_(7)                                               /**< (FLEX_SPI_CR) SPI Software Reset Position */
#define FLEX_SPI_CR_SWRST_Msk                 (_U_(0x1) << FLEX_SPI_CR_SWRST_Pos)                  /**< (FLEX_SPI_CR) SPI Software Reset Mask */
#define FLEX_SPI_CR_SWRST(value)              (FLEX_SPI_CR_SWRST_Msk & ((value) << FLEX_SPI_CR_SWRST_Pos))
#define FLEX_SPI_CR_REQCLR_Pos                _U_(12)                                              /**< (FLEX_SPI_CR) Request to Clear the Comparison Trigger Position */
#define FLEX_SPI_CR_REQCLR_Msk                (_U_(0x1) << FLEX_SPI_CR_REQCLR_Pos)                 /**< (FLEX_SPI_CR) Request to Clear the Comparison Trigger Mask */
#define FLEX_SPI_CR_REQCLR(value)             (FLEX_SPI_CR_REQCLR_Msk & ((value) << FLEX_SPI_CR_REQCLR_Pos))
#define FLEX_SPI_CR_TXFCLR_Pos                _U_(16)                                              /**< (FLEX_SPI_CR) Transmit FIFO Clear Position */
#define FLEX_SPI_CR_TXFCLR_Msk                (_U_(0x1) << FLEX_SPI_CR_TXFCLR_Pos)                 /**< (FLEX_SPI_CR) Transmit FIFO Clear Mask */
#define FLEX_SPI_CR_TXFCLR(value)             (FLEX_SPI_CR_TXFCLR_Msk & ((value) << FLEX_SPI_CR_TXFCLR_Pos))
#define FLEX_SPI_CR_RXFCLR_Pos                _U_(17)                                              /**< (FLEX_SPI_CR) Receive FIFO Clear Position */
#define FLEX_SPI_CR_RXFCLR_Msk                (_U_(0x1) << FLEX_SPI_CR_RXFCLR_Pos)                 /**< (FLEX_SPI_CR) Receive FIFO Clear Mask */
#define FLEX_SPI_CR_RXFCLR(value)             (FLEX_SPI_CR_RXFCLR_Msk & ((value) << FLEX_SPI_CR_RXFCLR_Pos))
#define FLEX_SPI_CR_LASTXFER_Pos              _U_(24)                                              /**< (FLEX_SPI_CR) Last Transfer Position */
#define FLEX_SPI_CR_LASTXFER_Msk              (_U_(0x1) << FLEX_SPI_CR_LASTXFER_Pos)               /**< (FLEX_SPI_CR) Last Transfer Mask */
#define FLEX_SPI_CR_LASTXFER(value)           (FLEX_SPI_CR_LASTXFER_Msk & ((value) << FLEX_SPI_CR_LASTXFER_Pos))
#define FLEX_SPI_CR_FIFOEN_Pos                _U_(30)                                              /**< (FLEX_SPI_CR) FIFO Enable Position */
#define FLEX_SPI_CR_FIFOEN_Msk                (_U_(0x1) << FLEX_SPI_CR_FIFOEN_Pos)                 /**< (FLEX_SPI_CR) FIFO Enable Mask */
#define FLEX_SPI_CR_FIFOEN(value)             (FLEX_SPI_CR_FIFOEN_Msk & ((value) << FLEX_SPI_CR_FIFOEN_Pos))
#define FLEX_SPI_CR_FIFODIS_Pos               _U_(31)                                              /**< (FLEX_SPI_CR) FIFO Disable Position */
#define FLEX_SPI_CR_FIFODIS_Msk               (_U_(0x1) << FLEX_SPI_CR_FIFODIS_Pos)                /**< (FLEX_SPI_CR) FIFO Disable Mask */
#define FLEX_SPI_CR_FIFODIS(value)            (FLEX_SPI_CR_FIFODIS_Msk & ((value) << FLEX_SPI_CR_FIFODIS_Pos))
#define FLEX_SPI_CR_Msk                       _U_(0xC1031083)                                      /**< (FLEX_SPI_CR) Register Mask  */


/* -------- FLEX_SPI_MR : (FLEXCOM Offset: 0x404) (R/W 32) SPI Mode Register -------- */
#define FLEX_SPI_MR_MSTR_Pos                  _U_(0)                                               /**< (FLEX_SPI_MR) Master/Slave Mode Position */
#define FLEX_SPI_MR_MSTR_Msk                  (_U_(0x1) << FLEX_SPI_MR_MSTR_Pos)                   /**< (FLEX_SPI_MR) Master/Slave Mode Mask */
#define FLEX_SPI_MR_MSTR(value)               (FLEX_SPI_MR_MSTR_Msk & ((value) << FLEX_SPI_MR_MSTR_Pos))
#define FLEX_SPI_MR_PS_Pos                    _U_(1)                                               /**< (FLEX_SPI_MR) Peripheral Select Position */
#define FLEX_SPI_MR_PS_Msk                    (_U_(0x1) << FLEX_SPI_MR_PS_Pos)                     /**< (FLEX_SPI_MR) Peripheral Select Mask */
#define FLEX_SPI_MR_PS(value)                 (FLEX_SPI_MR_PS_Msk & ((value) << FLEX_SPI_MR_PS_Pos))
#define FLEX_SPI_MR_PCSDEC_Pos                _U_(2)                                               /**< (FLEX_SPI_MR) Chip Select Decode Position */
#define FLEX_SPI_MR_PCSDEC_Msk                (_U_(0x1) << FLEX_SPI_MR_PCSDEC_Pos)                 /**< (FLEX_SPI_MR) Chip Select Decode Mask */
#define FLEX_SPI_MR_PCSDEC(value)             (FLEX_SPI_MR_PCSDEC_Msk & ((value) << FLEX_SPI_MR_PCSDEC_Pos))
#define FLEX_SPI_MR_BRSRCCLK_Pos              _U_(3)                                               /**< (FLEX_SPI_MR) Bit Rate Source Clock Position */
#define FLEX_SPI_MR_BRSRCCLK_Msk              (_U_(0x1) << FLEX_SPI_MR_BRSRCCLK_Pos)               /**< (FLEX_SPI_MR) Bit Rate Source Clock Mask */
#define FLEX_SPI_MR_BRSRCCLK(value)           (FLEX_SPI_MR_BRSRCCLK_Msk & ((value) << FLEX_SPI_MR_BRSRCCLK_Pos))
#define   FLEX_SPI_MR_BRSRCCLK_PERIPH_CLK_Val _U_(0x0)                                             /**< (FLEX_SPI_MR) The peripheral clock is the source clock for the bit rate generation.  */
#define   FLEX_SPI_MR_BRSRCCLK_GCLK_Val       _U_(0x1)                                             /**< (FLEX_SPI_MR) GCLK is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock.  */
#define FLEX_SPI_MR_BRSRCCLK_PERIPH_CLK       (FLEX_SPI_MR_BRSRCCLK_PERIPH_CLK_Val << FLEX_SPI_MR_BRSRCCLK_Pos) /**< (FLEX_SPI_MR) The peripheral clock is the source clock for the bit rate generation. Position  */
#define FLEX_SPI_MR_BRSRCCLK_GCLK             (FLEX_SPI_MR_BRSRCCLK_GCLK_Val << FLEX_SPI_MR_BRSRCCLK_Pos) /**< (FLEX_SPI_MR) GCLK is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock. Position  */
#define FLEX_SPI_MR_MODFDIS_Pos               _U_(4)                                               /**< (FLEX_SPI_MR) Mode Fault Detection Position */
#define FLEX_SPI_MR_MODFDIS_Msk               (_U_(0x1) << FLEX_SPI_MR_MODFDIS_Pos)                /**< (FLEX_SPI_MR) Mode Fault Detection Mask */
#define FLEX_SPI_MR_MODFDIS(value)            (FLEX_SPI_MR_MODFDIS_Msk & ((value) << FLEX_SPI_MR_MODFDIS_Pos))
#define FLEX_SPI_MR_WDRBT_Pos                 _U_(5)                                               /**< (FLEX_SPI_MR) Wait Data Read Before Transfer Position */
#define FLEX_SPI_MR_WDRBT_Msk                 (_U_(0x1) << FLEX_SPI_MR_WDRBT_Pos)                  /**< (FLEX_SPI_MR) Wait Data Read Before Transfer Mask */
#define FLEX_SPI_MR_WDRBT(value)              (FLEX_SPI_MR_WDRBT_Msk & ((value) << FLEX_SPI_MR_WDRBT_Pos))
#define FLEX_SPI_MR_LLB_Pos                   _U_(7)                                               /**< (FLEX_SPI_MR) Local Loopback Enable Position */
#define FLEX_SPI_MR_LLB_Msk                   (_U_(0x1) << FLEX_SPI_MR_LLB_Pos)                    /**< (FLEX_SPI_MR) Local Loopback Enable Mask */
#define FLEX_SPI_MR_LLB(value)                (FLEX_SPI_MR_LLB_Msk & ((value) << FLEX_SPI_MR_LLB_Pos))
#define FLEX_SPI_MR_LBHPC_Pos                 _U_(8)                                               /**< (FLEX_SPI_MR) Last Bit Half Period Compatibility Position */
#define FLEX_SPI_MR_LBHPC_Msk                 (_U_(0x1) << FLEX_SPI_MR_LBHPC_Pos)                  /**< (FLEX_SPI_MR) Last Bit Half Period Compatibility Mask */
#define FLEX_SPI_MR_LBHPC(value)              (FLEX_SPI_MR_LBHPC_Msk & ((value) << FLEX_SPI_MR_LBHPC_Pos))
#define FLEX_SPI_MR_CMPMODE_Pos               _U_(12)                                              /**< (FLEX_SPI_MR) Comparison Mode Position */
#define FLEX_SPI_MR_CMPMODE_Msk               (_U_(0x1) << FLEX_SPI_MR_CMPMODE_Pos)                /**< (FLEX_SPI_MR) Comparison Mode Mask */
#define FLEX_SPI_MR_CMPMODE(value)            (FLEX_SPI_MR_CMPMODE_Msk & ((value) << FLEX_SPI_MR_CMPMODE_Pos))
#define   FLEX_SPI_MR_CMPMODE_FLAG_ONLY_Val   _U_(0x0)                                             /**< (FLEX_SPI_MR) Any character is received and comparison function drives CMP flag.  */
#define   FLEX_SPI_MR_CMPMODE_START_CONDITION_Val _U_(0x1)                                             /**< (FLEX_SPI_MR) Comparison condition must be met to start reception of all incoming characters until REQCLR is set.  */
#define FLEX_SPI_MR_CMPMODE_FLAG_ONLY         (FLEX_SPI_MR_CMPMODE_FLAG_ONLY_Val << FLEX_SPI_MR_CMPMODE_Pos) /**< (FLEX_SPI_MR) Any character is received and comparison function drives CMP flag. Position  */
#define FLEX_SPI_MR_CMPMODE_START_CONDITION   (FLEX_SPI_MR_CMPMODE_START_CONDITION_Val << FLEX_SPI_MR_CMPMODE_Pos) /**< (FLEX_SPI_MR) Comparison condition must be met to start reception of all incoming characters until REQCLR is set. Position  */
#define FLEX_SPI_MR_PCS_Pos                   _U_(16)                                              /**< (FLEX_SPI_MR) Peripheral Chip Select Position */
#define FLEX_SPI_MR_PCS_Msk                   (_U_(0xF) << FLEX_SPI_MR_PCS_Pos)                    /**< (FLEX_SPI_MR) Peripheral Chip Select Mask */
#define FLEX_SPI_MR_PCS(value)                (FLEX_SPI_MR_PCS_Msk & ((value) << FLEX_SPI_MR_PCS_Pos))
#define FLEX_SPI_MR_DLYBCS_Pos                _U_(24)                                              /**< (FLEX_SPI_MR) Delay Between Chip Selects Position */
#define FLEX_SPI_MR_DLYBCS_Msk                (_U_(0xFF) << FLEX_SPI_MR_DLYBCS_Pos)                /**< (FLEX_SPI_MR) Delay Between Chip Selects Mask */
#define FLEX_SPI_MR_DLYBCS(value)             (FLEX_SPI_MR_DLYBCS_Msk & ((value) << FLEX_SPI_MR_DLYBCS_Pos))
#define FLEX_SPI_MR_Msk                       _U_(0xFF0F11BF)                                      /**< (FLEX_SPI_MR) Register Mask  */


/* -------- FLEX_SPI_RDR : (FLEXCOM Offset: 0x408) ( R/ 32) SPI Receive Data Register -------- */
#define FLEX_SPI_RDR_RD_Pos                   _U_(0)                                               /**< (FLEX_SPI_RDR) Receive Data Position */
#define FLEX_SPI_RDR_RD_Msk                   (_U_(0xFFFF) << FLEX_SPI_RDR_RD_Pos)                 /**< (FLEX_SPI_RDR) Receive Data Mask */
#define FLEX_SPI_RDR_RD(value)                (FLEX_SPI_RDR_RD_Msk & ((value) << FLEX_SPI_RDR_RD_Pos))
#define FLEX_SPI_RDR_PCS_Pos                  _U_(16)                                              /**< (FLEX_SPI_RDR) Peripheral Chip Select Position */
#define FLEX_SPI_RDR_PCS_Msk                  (_U_(0xF) << FLEX_SPI_RDR_PCS_Pos)                   /**< (FLEX_SPI_RDR) Peripheral Chip Select Mask */
#define FLEX_SPI_RDR_PCS(value)               (FLEX_SPI_RDR_PCS_Msk & ((value) << FLEX_SPI_RDR_PCS_Pos))
#define FLEX_SPI_RDR_Msk                      _U_(0x000FFFFF)                                      /**< (FLEX_SPI_RDR) Register Mask  */

/* FIFO_MULTI_DATA_8 mode */
#define FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD0_Pos _U_(0)                                               /**< (FLEX_SPI_RDR) Receive Data Position */
#define FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD0_Msk (_U_(0xFF) << FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD0_Pos) /**< (FLEX_SPI_RDR) Receive Data Mask */
#define FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD0(value) (FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD0_Msk & ((value) << FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD0_Pos))
#define FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD1_Pos _U_(8)                                               /**< (FLEX_SPI_RDR) Receive Data Position */
#define FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD1_Msk (_U_(0xFF) << FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD1_Pos) /**< (FLEX_SPI_RDR) Receive Data Mask */
#define FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD1(value) (FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD1_Msk & ((value) << FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD1_Pos))
#define FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD2_Pos _U_(16)                                              /**< (FLEX_SPI_RDR) Receive Data Position */
#define FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD2_Msk (_U_(0xFF) << FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD2_Pos) /**< (FLEX_SPI_RDR) Receive Data Mask */
#define FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD2(value) (FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD2_Msk & ((value) << FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD2_Pos))
#define FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD3_Pos _U_(24)                                              /**< (FLEX_SPI_RDR) Receive Data Position */
#define FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD3_Msk (_U_(0xFF) << FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD3_Pos) /**< (FLEX_SPI_RDR) Receive Data Mask */
#define FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD3(value) (FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD3_Msk & ((value) << FLEX_SPI_RDR_FIFO_MULTI_DATA_8_RD3_Pos))
#define FLEX_SPI_RDR_FIFO_MULTI_DATA_8_Msk    _U_(0xFFFFFFFF)                                       /**< (FLEX_SPI_RDR_FIFO_MULTI_DATA_8) Register Mask  */

/* FIFO_MULTI_DATA_16 mode */
#define FLEX_SPI_RDR_FIFO_MULTI_DATA_16_RD0_Pos _U_(0)                                               /**< (FLEX_SPI_RDR) Receive Data Position */
#define FLEX_SPI_RDR_FIFO_MULTI_DATA_16_RD0_Msk (_U_(0xFFFF) << FLEX_SPI_RDR_FIFO_MULTI_DATA_16_RD0_Pos) /**< (FLEX_SPI_RDR) Receive Data Mask */
#define FLEX_SPI_RDR_FIFO_MULTI_DATA_16_RD0(value) (FLEX_SPI_RDR_FIFO_MULTI_DATA_16_RD0_Msk & ((value) << FLEX_SPI_RDR_FIFO_MULTI_DATA_16_RD0_Pos))
#define FLEX_SPI_RDR_FIFO_MULTI_DATA_16_RD1_Pos _U_(16)                                              /**< (FLEX_SPI_RDR) Receive Data Position */
#define FLEX_SPI_RDR_FIFO_MULTI_DATA_16_RD1_Msk (_U_(0xFFFF) << FLEX_SPI_RDR_FIFO_MULTI_DATA_16_RD1_Pos) /**< (FLEX_SPI_RDR) Receive Data Mask */
#define FLEX_SPI_RDR_FIFO_MULTI_DATA_16_RD1(value) (FLEX_SPI_RDR_FIFO_MULTI_DATA_16_RD1_Msk & ((value) << FLEX_SPI_RDR_FIFO_MULTI_DATA_16_RD1_Pos))
#define FLEX_SPI_RDR_FIFO_MULTI_DATA_16_Msk   _U_(0xFFFFFFFF)                                       /**< (FLEX_SPI_RDR_FIFO_MULTI_DATA_16) Register Mask  */


/* -------- FLEX_SPI_TDR : (FLEXCOM Offset: 0x40C) ( /W 32) SPI Transmit Data Register -------- */
#define FLEX_SPI_TDR_TD_Pos                   _U_(0)                                               /**< (FLEX_SPI_TDR) Transmit Data Position */
#define FLEX_SPI_TDR_TD_Msk                   (_U_(0xFFFF) << FLEX_SPI_TDR_TD_Pos)                 /**< (FLEX_SPI_TDR) Transmit Data Mask */
#define FLEX_SPI_TDR_TD(value)                (FLEX_SPI_TDR_TD_Msk & ((value) << FLEX_SPI_TDR_TD_Pos))
#define FLEX_SPI_TDR_PCS_Pos                  _U_(16)                                              /**< (FLEX_SPI_TDR) Peripheral Chip Select Position */
#define FLEX_SPI_TDR_PCS_Msk                  (_U_(0xF) << FLEX_SPI_TDR_PCS_Pos)                   /**< (FLEX_SPI_TDR) Peripheral Chip Select Mask */
#define FLEX_SPI_TDR_PCS(value)               (FLEX_SPI_TDR_PCS_Msk & ((value) << FLEX_SPI_TDR_PCS_Pos))
#define FLEX_SPI_TDR_LASTXFER_Pos             _U_(24)                                              /**< (FLEX_SPI_TDR) Last Transfer Position */
#define FLEX_SPI_TDR_LASTXFER_Msk             (_U_(0x1) << FLEX_SPI_TDR_LASTXFER_Pos)              /**< (FLEX_SPI_TDR) Last Transfer Mask */
#define FLEX_SPI_TDR_LASTXFER(value)          (FLEX_SPI_TDR_LASTXFER_Msk & ((value) << FLEX_SPI_TDR_LASTXFER_Pos))
#define FLEX_SPI_TDR_Msk                      _U_(0x010FFFFF)                                      /**< (FLEX_SPI_TDR) Register Mask  */

/* FIFO_MULTI_DATA mode */
#define FLEX_SPI_TDR_FIFO_MULTI_DATA_TD0_Pos  _U_(0)                                               /**< (FLEX_SPI_TDR) Transmit Data Position */
#define FLEX_SPI_TDR_FIFO_MULTI_DATA_TD0_Msk  (_U_(0xFFFF) << FLEX_SPI_TDR_FIFO_MULTI_DATA_TD0_Pos) /**< (FLEX_SPI_TDR) Transmit Data Mask */
#define FLEX_SPI_TDR_FIFO_MULTI_DATA_TD0(value) (FLEX_SPI_TDR_FIFO_MULTI_DATA_TD0_Msk & ((value) << FLEX_SPI_TDR_FIFO_MULTI_DATA_TD0_Pos))
#define FLEX_SPI_TDR_FIFO_MULTI_DATA_TD1_Pos  _U_(16)                                              /**< (FLEX_SPI_TDR) Transmit Data Position */
#define FLEX_SPI_TDR_FIFO_MULTI_DATA_TD1_Msk  (_U_(0xFFFF) << FLEX_SPI_TDR_FIFO_MULTI_DATA_TD1_Pos) /**< (FLEX_SPI_TDR) Transmit Data Mask */
#define FLEX_SPI_TDR_FIFO_MULTI_DATA_TD1(value) (FLEX_SPI_TDR_FIFO_MULTI_DATA_TD1_Msk & ((value) << FLEX_SPI_TDR_FIFO_MULTI_DATA_TD1_Pos))
#define FLEX_SPI_TDR_FIFO_MULTI_DATA_Msk      _U_(0xFFFFFFFF)                                       /**< (FLEX_SPI_TDR_FIFO_MULTI_DATA) Register Mask  */


