Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/flexcom.h
/* -------- FLEX_SPI_SR : (FLEXCOM Offset: 0x410) ( R/ 32) SPI Status Register -------- */
#define FLEX_SPI_SR_RDRF_Pos                  _U_(0)                                               /**< (FLEX_SPI_SR) Receive Data Register Full (cleared by reading FLEX_SPI_RDR) Position */
#define FLEX_SPI_SR_RDRF_Msk                  (_U_(0x1) << FLEX_SPI_SR_RDRF_Pos)                   /**< (FLEX_SPI_SR) Receive Data Register Full (cleared by reading FLEX_SPI_RDR) Mask */
#define FLEX_SPI_SR_RDRF(value)               (FLEX_SPI_SR_RDRF_Msk & ((value) << FLEX_SPI_SR_RDRF_Pos))
#define FLEX_SPI_SR_TDRE_Pos                  _U_(1)                                               /**< (FLEX_SPI_SR) Transmit Data Register Empty (cleared by writing FLEX_SPI_TDR) Position */
#define FLEX_SPI_SR_TDRE_Msk                  (_U_(0x1) << FLEX_SPI_SR_TDRE_Pos)                   /**< (FLEX_SPI_SR) Transmit Data Register Empty (cleared by writing FLEX_SPI_TDR) Mask */
#define FLEX_SPI_SR_TDRE(value)               (FLEX_SPI_SR_TDRE_Msk & ((value) << FLEX_SPI_SR_TDRE_Pos))
#define FLEX_SPI_SR_MODF_Pos                  _U_(2)                                               /**< (FLEX_SPI_SR) Mode Fault Error (cleared on read) Position */
#define FLEX_SPI_SR_MODF_Msk                  (_U_(0x1) << FLEX_SPI_SR_MODF_Pos)                   /**< (FLEX_SPI_SR) Mode Fault Error (cleared on read) Mask */
#define FLEX_SPI_SR_MODF(value)               (FLEX_SPI_SR_MODF_Msk & ((value) << FLEX_SPI_SR_MODF_Pos))
#define FLEX_SPI_SR_OVRES_Pos                 _U_(3)                                               /**< (FLEX_SPI_SR) Overrun Error Status (cleared on read) Position */
#define FLEX_SPI_SR_OVRES_Msk                 (_U_(0x1) << FLEX_SPI_SR_OVRES_Pos)                  /**< (FLEX_SPI_SR) Overrun Error Status (cleared on read) Mask */
#define FLEX_SPI_SR_OVRES(value)              (FLEX_SPI_SR_OVRES_Msk & ((value) << FLEX_SPI_SR_OVRES_Pos))
#define FLEX_SPI_SR_NSSR_Pos                  _U_(8)                                               /**< (FLEX_SPI_SR) NSS Rising (cleared on read) Position */
#define FLEX_SPI_SR_NSSR_Msk                  (_U_(0x1) << FLEX_SPI_SR_NSSR_Pos)                   /**< (FLEX_SPI_SR) NSS Rising (cleared on read) Mask */
#define FLEX_SPI_SR_NSSR(value)               (FLEX_SPI_SR_NSSR_Msk & ((value) << FLEX_SPI_SR_NSSR_Pos))
#define FLEX_SPI_SR_TXEMPTY_Pos               _U_(9)                                               /**< (FLEX_SPI_SR) Transmission Registers Empty (cleared by writing FLEX_SPI_TDR) Position */
#define FLEX_SPI_SR_TXEMPTY_Msk               (_U_(0x1) << FLEX_SPI_SR_TXEMPTY_Pos)                /**< (FLEX_SPI_SR) Transmission Registers Empty (cleared by writing FLEX_SPI_TDR) Mask */
#define FLEX_SPI_SR_TXEMPTY(value)            (FLEX_SPI_SR_TXEMPTY_Msk & ((value) << FLEX_SPI_SR_TXEMPTY_Pos))
#define FLEX_SPI_SR_UNDES_Pos                 _U_(10)                                              /**< (FLEX_SPI_SR) Underrun Error Status (Slave mode only) (cleared on read) Position */
#define FLEX_SPI_SR_UNDES_Msk                 (_U_(0x1) << FLEX_SPI_SR_UNDES_Pos)                  /**< (FLEX_SPI_SR) Underrun Error Status (Slave mode only) (cleared on read) Mask */
#define FLEX_SPI_SR_UNDES(value)              (FLEX_SPI_SR_UNDES_Msk & ((value) << FLEX_SPI_SR_UNDES_Pos))
#define FLEX_SPI_SR_CMP_Pos                   _U_(11)                                              /**< (FLEX_SPI_SR) Comparison Status (cleared on read) Position */
#define FLEX_SPI_SR_CMP_Msk                   (_U_(0x1) << FLEX_SPI_SR_CMP_Pos)                    /**< (FLEX_SPI_SR) Comparison Status (cleared on read) Mask */
#define FLEX_SPI_SR_CMP(value)                (FLEX_SPI_SR_CMP_Msk & ((value) << FLEX_SPI_SR_CMP_Pos))
#define FLEX_SPI_SR_SFERR_Pos                 _U_(12)                                              /**< (FLEX_SPI_SR) Slave Frame Error (cleared on read) Position */
#define FLEX_SPI_SR_SFERR_Msk                 (_U_(0x1) << FLEX_SPI_SR_SFERR_Pos)                  /**< (FLEX_SPI_SR) Slave Frame Error (cleared on read) Mask */
#define FLEX_SPI_SR_SFERR(value)              (FLEX_SPI_SR_SFERR_Msk & ((value) << FLEX_SPI_SR_SFERR_Pos))
#define FLEX_SPI_SR_SPIENS_Pos                _U_(16)                                              /**< (FLEX_SPI_SR) SPI Enable Status Position */
#define FLEX_SPI_SR_SPIENS_Msk                (_U_(0x1) << FLEX_SPI_SR_SPIENS_Pos)                 /**< (FLEX_SPI_SR) SPI Enable Status Mask */
#define FLEX_SPI_SR_SPIENS(value)             (FLEX_SPI_SR_SPIENS_Msk & ((value) << FLEX_SPI_SR_SPIENS_Pos))
#define FLEX_SPI_SR_TXFEF_Pos                 _U_(24)                                              /**< (FLEX_SPI_SR) Transmit FIFO Empty Flag (cleared on read) Position */
#define FLEX_SPI_SR_TXFEF_Msk                 (_U_(0x1) << FLEX_SPI_SR_TXFEF_Pos)                  /**< (FLEX_SPI_SR) Transmit FIFO Empty Flag (cleared on read) Mask */
#define FLEX_SPI_SR_TXFEF(value)              (FLEX_SPI_SR_TXFEF_Msk & ((value) << FLEX_SPI_SR_TXFEF_Pos))
#define FLEX_SPI_SR_TXFFF_Pos                 _U_(25)                                              /**< (FLEX_SPI_SR) Transmit FIFO Full Flag (cleared on read) Position */
#define FLEX_SPI_SR_TXFFF_Msk                 (_U_(0x1) << FLEX_SPI_SR_TXFFF_Pos)                  /**< (FLEX_SPI_SR) Transmit FIFO Full Flag (cleared on read) Mask */
#define FLEX_SPI_SR_TXFFF(value)              (FLEX_SPI_SR_TXFFF_Msk & ((value) << FLEX_SPI_SR_TXFFF_Pos))
#define FLEX_SPI_SR_TXFTHF_Pos                _U_(26)                                              /**< (FLEX_SPI_SR) Transmit FIFO Threshold Flag (cleared on read) Position */
#define FLEX_SPI_SR_TXFTHF_Msk                (_U_(0x1) << FLEX_SPI_SR_TXFTHF_Pos)                 /**< (FLEX_SPI_SR) Transmit FIFO Threshold Flag (cleared on read) Mask */
#define FLEX_SPI_SR_TXFTHF(value)             (FLEX_SPI_SR_TXFTHF_Msk & ((value) << FLEX_SPI_SR_TXFTHF_Pos))
#define FLEX_SPI_SR_RXFEF_Pos                 _U_(27)                                              /**< (FLEX_SPI_SR) Receive FIFO Empty Flag Position */
#define FLEX_SPI_SR_RXFEF_Msk                 (_U_(0x1) << FLEX_SPI_SR_RXFEF_Pos)                  /**< (FLEX_SPI_SR) Receive FIFO Empty Flag Mask */
#define FLEX_SPI_SR_RXFEF(value)              (FLEX_SPI_SR_RXFEF_Msk & ((value) << FLEX_SPI_SR_RXFEF_Pos))
#define FLEX_SPI_SR_RXFFF_Pos                 _U_(28)                                              /**< (FLEX_SPI_SR) Receive FIFO Full Flag Position */
#define FLEX_SPI_SR_RXFFF_Msk                 (_U_(0x1) << FLEX_SPI_SR_RXFFF_Pos)                  /**< (FLEX_SPI_SR) Receive FIFO Full Flag Mask */
#define FLEX_SPI_SR_RXFFF(value)              (FLEX_SPI_SR_RXFFF_Msk & ((value) << FLEX_SPI_SR_RXFFF_Pos))
#define FLEX_SPI_SR_RXFTHF_Pos                _U_(29)                                              /**< (FLEX_SPI_SR) Receive FIFO Threshold Flag Position */
#define FLEX_SPI_SR_RXFTHF_Msk                (_U_(0x1) << FLEX_SPI_SR_RXFTHF_Pos)                 /**< (FLEX_SPI_SR) Receive FIFO Threshold Flag Mask */
#define FLEX_SPI_SR_RXFTHF(value)             (FLEX_SPI_SR_RXFTHF_Msk & ((value) << FLEX_SPI_SR_RXFTHF_Pos))
#define FLEX_SPI_SR_TXFPTEF_Pos               _U_(30)                                              /**< (FLEX_SPI_SR) Transmit FIFO Pointer Error Flag Position */
#define FLEX_SPI_SR_TXFPTEF_Msk               (_U_(0x1) << FLEX_SPI_SR_TXFPTEF_Pos)                /**< (FLEX_SPI_SR) Transmit FIFO Pointer Error Flag Mask */
#define FLEX_SPI_SR_TXFPTEF(value)            (FLEX_SPI_SR_TXFPTEF_Msk & ((value) << FLEX_SPI_SR_TXFPTEF_Pos))
#define FLEX_SPI_SR_RXFPTEF_Pos               _U_(31)                                              /**< (FLEX_SPI_SR) Receive FIFO Pointer Error Flag Position */
#define FLEX_SPI_SR_RXFPTEF_Msk               (_U_(0x1) << FLEX_SPI_SR_RXFPTEF_Pos)                /**< (FLEX_SPI_SR) Receive FIFO Pointer Error Flag Mask */
#define FLEX_SPI_SR_RXFPTEF(value)            (FLEX_SPI_SR_RXFPTEF_Msk & ((value) << FLEX_SPI_SR_RXFPTEF_Pos))
#define FLEX_SPI_SR_Msk                       _U_(0xFF011F0F)                                      /**< (FLEX_SPI_SR) Register Mask  */


/* -------- FLEX_SPI_IER : (FLEXCOM Offset: 0x414) ( /W 32) SPI Interrupt Enable Register -------- */
#define FLEX_SPI_IER_RDRF_Pos                 _U_(0)                                               /**< (FLEX_SPI_IER) Receive Data Register Full Interrupt Enable Position */
#define FLEX_SPI_IER_RDRF_Msk                 (_U_(0x1) << FLEX_SPI_IER_RDRF_Pos)                  /**< (FLEX_SPI_IER) Receive Data Register Full Interrupt Enable Mask */
#define FLEX_SPI_IER_RDRF(value)              (FLEX_SPI_IER_RDRF_Msk & ((value) << FLEX_SPI_IER_RDRF_Pos))
#define FLEX_SPI_IER_TDRE_Pos                 _U_(1)                                               /**< (FLEX_SPI_IER) SPI Transmit Data Register Empty Interrupt Enable Position */
#define FLEX_SPI_IER_TDRE_Msk                 (_U_(0x1) << FLEX_SPI_IER_TDRE_Pos)                  /**< (FLEX_SPI_IER) SPI Transmit Data Register Empty Interrupt Enable Mask */
#define FLEX_SPI_IER_TDRE(value)              (FLEX_SPI_IER_TDRE_Msk & ((value) << FLEX_SPI_IER_TDRE_Pos))
#define FLEX_SPI_IER_MODF_Pos                 _U_(2)                                               /**< (FLEX_SPI_IER) Mode Fault Error Interrupt Enable Position */
#define FLEX_SPI_IER_MODF_Msk                 (_U_(0x1) << FLEX_SPI_IER_MODF_Pos)                  /**< (FLEX_SPI_IER) Mode Fault Error Interrupt Enable Mask */
#define FLEX_SPI_IER_MODF(value)              (FLEX_SPI_IER_MODF_Msk & ((value) << FLEX_SPI_IER_MODF_Pos))
#define FLEX_SPI_IER_OVRES_Pos                _U_(3)                                               /**< (FLEX_SPI_IER) Overrun Error Interrupt Enable Position */
#define FLEX_SPI_IER_OVRES_Msk                (_U_(0x1) << FLEX_SPI_IER_OVRES_Pos)                 /**< (FLEX_SPI_IER) Overrun Error Interrupt Enable Mask */
#define FLEX_SPI_IER_OVRES(value)             (FLEX_SPI_IER_OVRES_Msk & ((value) << FLEX_SPI_IER_OVRES_Pos))
#define FLEX_SPI_IER_NSSR_Pos                 _U_(8)                                               /**< (FLEX_SPI_IER) NSS Rising Interrupt Enable Position */
#define FLEX_SPI_IER_NSSR_Msk                 (_U_(0x1) << FLEX_SPI_IER_NSSR_Pos)                  /**< (FLEX_SPI_IER) NSS Rising Interrupt Enable Mask */
#define FLEX_SPI_IER_NSSR(value)              (FLEX_SPI_IER_NSSR_Msk & ((value) << FLEX_SPI_IER_NSSR_Pos))
#define FLEX_SPI_IER_TXEMPTY_Pos              _U_(9)                                               /**< (FLEX_SPI_IER) Transmission Registers Empty Enable Position */
#define FLEX_SPI_IER_TXEMPTY_Msk              (_U_(0x1) << FLEX_SPI_IER_TXEMPTY_Pos)               /**< (FLEX_SPI_IER) Transmission Registers Empty Enable Mask */
#define FLEX_SPI_IER_TXEMPTY(value)           (FLEX_SPI_IER_TXEMPTY_Msk & ((value) << FLEX_SPI_IER_TXEMPTY_Pos))
#define FLEX_SPI_IER_UNDES_Pos                _U_(10)                                              /**< (FLEX_SPI_IER) Underrun Error Interrupt Enable Position */
#define FLEX_SPI_IER_UNDES_Msk                (_U_(0x1) << FLEX_SPI_IER_UNDES_Pos)                 /**< (FLEX_SPI_IER) Underrun Error Interrupt Enable Mask */
#define FLEX_SPI_IER_UNDES(value)             (FLEX_SPI_IER_UNDES_Msk & ((value) << FLEX_SPI_IER_UNDES_Pos))
#define FLEX_SPI_IER_CMP_Pos                  _U_(11)                                              /**< (FLEX_SPI_IER) Comparison Interrupt Enable Position */
#define FLEX_SPI_IER_CMP_Msk                  (_U_(0x1) << FLEX_SPI_IER_CMP_Pos)                   /**< (FLEX_SPI_IER) Comparison Interrupt Enable Mask */
#define FLEX_SPI_IER_CMP(value)               (FLEX_SPI_IER_CMP_Msk & ((value) << FLEX_SPI_IER_CMP_Pos))
#define FLEX_SPI_IER_TXFEF_Pos                _U_(24)                                              /**< (FLEX_SPI_IER) TXFEF Interrupt Enable Position */
#define FLEX_SPI_IER_TXFEF_Msk                (_U_(0x1) << FLEX_SPI_IER_TXFEF_Pos)                 /**< (FLEX_SPI_IER) TXFEF Interrupt Enable Mask */
#define FLEX_SPI_IER_TXFEF(value)             (FLEX_SPI_IER_TXFEF_Msk & ((value) << FLEX_SPI_IER_TXFEF_Pos))
#define FLEX_SPI_IER_TXFFF_Pos                _U_(25)                                              /**< (FLEX_SPI_IER) TXFFF Interrupt Enable Position */
#define FLEX_SPI_IER_TXFFF_Msk                (_U_(0x1) << FLEX_SPI_IER_TXFFF_Pos)                 /**< (FLEX_SPI_IER) TXFFF Interrupt Enable Mask */
#define FLEX_SPI_IER_TXFFF(value)             (FLEX_SPI_IER_TXFFF_Msk & ((value) << FLEX_SPI_IER_TXFFF_Pos))
#define FLEX_SPI_IER_TXFTHF_Pos               _U_(26)                                              /**< (FLEX_SPI_IER) TXFTHF Interrupt Enable Position */
#define FLEX_SPI_IER_TXFTHF_Msk               (_U_(0x1) << FLEX_SPI_IER_TXFTHF_Pos)                /**< (FLEX_SPI_IER) TXFTHF Interrupt Enable Mask */
#define FLEX_SPI_IER_TXFTHF(value)            (FLEX_SPI_IER_TXFTHF_Msk & ((value) << FLEX_SPI_IER_TXFTHF_Pos))
#define FLEX_SPI_IER_RXFEF_Pos                _U_(27)                                              /**< (FLEX_SPI_IER) RXFEF Interrupt Enable Position */
#define FLEX_SPI_IER_RXFEF_Msk                (_U_(0x1) << FLEX_SPI_IER_RXFEF_Pos)                 /**< (FLEX_SPI_IER) RXFEF Interrupt Enable Mask */
#define FLEX_SPI_IER_RXFEF(value)             (FLEX_SPI_IER_RXFEF_Msk & ((value) << FLEX_SPI_IER_RXFEF_Pos))
#define FLEX_SPI_IER_RXFFF_Pos                _U_(28)                                              /**< (FLEX_SPI_IER) RXFFF Interrupt Enable Position */
#define FLEX_SPI_IER_RXFFF_Msk                (_U_(0x1) << FLEX_SPI_IER_RXFFF_Pos)                 /**< (FLEX_SPI_IER) RXFFF Interrupt Enable Mask */
#define FLEX_SPI_IER_RXFFF(value)             (FLEX_SPI_IER_RXFFF_Msk & ((value) << FLEX_SPI_IER_RXFFF_Pos))
#define FLEX_SPI_IER_RXFTHF_Pos               _U_(29)                                              /**< (FLEX_SPI_IER) RXFTHF Interrupt Enable Position */
#define FLEX_SPI_IER_RXFTHF_Msk               (_U_(0x1) << FLEX_SPI_IER_RXFTHF_Pos)                /**< (FLEX_SPI_IER) RXFTHF Interrupt Enable Mask */
#define FLEX_SPI_IER_RXFTHF(value)            (FLEX_SPI_IER_RXFTHF_Msk & ((value) << FLEX_SPI_IER_RXFTHF_Pos))
#define FLEX_SPI_IER_TXFPTEF_Pos              _U_(30)                                              /**< (FLEX_SPI_IER) TXFPTEF Interrupt Enable Position */
#define FLEX_SPI_IER_TXFPTEF_Msk              (_U_(0x1) << FLEX_SPI_IER_TXFPTEF_Pos)               /**< (FLEX_SPI_IER) TXFPTEF Interrupt Enable Mask */
#define FLEX_SPI_IER_TXFPTEF(value)           (FLEX_SPI_IER_TXFPTEF_Msk & ((value) << FLEX_SPI_IER_TXFPTEF_Pos))
#define FLEX_SPI_IER_RXFPTEF_Pos              _U_(31)                                              /**< (FLEX_SPI_IER) RXFPTEF Interrupt Enable Position */
#define FLEX_SPI_IER_RXFPTEF_Msk              (_U_(0x1) << FLEX_SPI_IER_RXFPTEF_Pos)               /**< (FLEX_SPI_IER) RXFPTEF Interrupt Enable Mask */
#define FLEX_SPI_IER_RXFPTEF(value)           (FLEX_SPI_IER_RXFPTEF_Msk & ((value) << FLEX_SPI_IER_RXFPTEF_Pos))
#define FLEX_SPI_IER_Msk                      _U_(0xFF000F0F)                                      /**< (FLEX_SPI_IER) Register Mask  */


/* -------- FLEX_SPI_IDR : (FLEXCOM Offset: 0x418) ( /W 32) SPI Interrupt Disable Register -------- */
#define FLEX_SPI_IDR_RDRF_Pos                 _U_(0)                                               /**< (FLEX_SPI_IDR) Receive Data Register Full Interrupt Disable Position */
#define FLEX_SPI_IDR_RDRF_Msk                 (_U_(0x1) << FLEX_SPI_IDR_RDRF_Pos)                  /**< (FLEX_SPI_IDR) Receive Data Register Full Interrupt Disable Mask */
#define FLEX_SPI_IDR_RDRF(value)              (FLEX_SPI_IDR_RDRF_Msk & ((value) << FLEX_SPI_IDR_RDRF_Pos))
#define FLEX_SPI_IDR_TDRE_Pos                 _U_(1)                                               /**< (FLEX_SPI_IDR) SPI Transmit Data Register Empty Interrupt Disable Position */
#define FLEX_SPI_IDR_TDRE_Msk                 (_U_(0x1) << FLEX_SPI_IDR_TDRE_Pos)                  /**< (FLEX_SPI_IDR) SPI Transmit Data Register Empty Interrupt Disable Mask */
#define FLEX_SPI_IDR_TDRE(value)              (FLEX_SPI_IDR_TDRE_Msk & ((value) << FLEX_SPI_IDR_TDRE_Pos))
#define FLEX_SPI_IDR_MODF_Pos                 _U_(2)                                               /**< (FLEX_SPI_IDR) Mode Fault Error Interrupt Disable Position */
#define FLEX_SPI_IDR_MODF_Msk                 (_U_(0x1) << FLEX_SPI_IDR_MODF_Pos)                  /**< (FLEX_SPI_IDR) Mode Fault Error Interrupt Disable Mask */
#define FLEX_SPI_IDR_MODF(value)              (FLEX_SPI_IDR_MODF_Msk & ((value) << FLEX_SPI_IDR_MODF_Pos))
#define FLEX_SPI_IDR_OVRES_Pos                _U_(3)                                               /**< (FLEX_SPI_IDR) Overrun Error Interrupt Disable Position */
#define FLEX_SPI_IDR_OVRES_Msk                (_U_(0x1) << FLEX_SPI_IDR_OVRES_Pos)                 /**< (FLEX_SPI_IDR) Overrun Error Interrupt Disable Mask */
#define FLEX_SPI_IDR_OVRES(value)             (FLEX_SPI_IDR_OVRES_Msk & ((value) << FLEX_SPI_IDR_OVRES_Pos))
#define FLEX_SPI_IDR_NSSR_Pos                 _U_(8)                                               /**< (FLEX_SPI_IDR) NSS Rising Interrupt Disable Position */
#define FLEX_SPI_IDR_NSSR_Msk                 (_U_(0x1) << FLEX_SPI_IDR_NSSR_Pos)                  /**< (FLEX_SPI_IDR) NSS Rising Interrupt Disable Mask */
#define FLEX_SPI_IDR_NSSR(value)              (FLEX_SPI_IDR_NSSR_Msk & ((value) << FLEX_SPI_IDR_NSSR_Pos))
#define FLEX_SPI_IDR_TXEMPTY_Pos              _U_(9)                                               /**< (FLEX_SPI_IDR) Transmission Registers Empty Disable Position */
#define FLEX_SPI_IDR_TXEMPTY_Msk              (_U_(0x1) << FLEX_SPI_IDR_TXEMPTY_Pos)               /**< (FLEX_SPI_IDR) Transmission Registers Empty Disable Mask */
#define FLEX_SPI_IDR_TXEMPTY(value)           (FLEX_SPI_IDR_TXEMPTY_Msk & ((value) << FLEX_SPI_IDR_TXEMPTY_Pos))
#define FLEX_SPI_IDR_UNDES_Pos                _U_(10)                                              /**< (FLEX_SPI_IDR) Underrun Error Interrupt Disable Position */
#define FLEX_SPI_IDR_UNDES_Msk                (_U_(0x1) << FLEX_SPI_IDR_UNDES_Pos)                 /**< (FLEX_SPI_IDR) Underrun Error Interrupt Disable Mask */
#define FLEX_SPI_IDR_UNDES(value)             (FLEX_SPI_IDR_UNDES_Msk & ((value) << FLEX_SPI_IDR_UNDES_Pos))
#define FLEX_SPI_IDR_CMP_Pos                  _U_(11)                                              /**< (FLEX_SPI_IDR) Comparison Interrupt Disable Position */
#define FLEX_SPI_IDR_CMP_Msk                  (_U_(0x1) << FLEX_SPI_IDR_CMP_Pos)                   /**< (FLEX_SPI_IDR) Comparison Interrupt Disable Mask */
#define FLEX_SPI_IDR_CMP(value)               (FLEX_SPI_IDR_CMP_Msk & ((value) << FLEX_SPI_IDR_CMP_Pos))
#define FLEX_SPI_IDR_TXFEF_Pos                _U_(24)                                              /**< (FLEX_SPI_IDR) TXFEF Interrupt Disable Position */
#define FLEX_SPI_IDR_TXFEF_Msk                (_U_(0x1) << FLEX_SPI_IDR_TXFEF_Pos)                 /**< (FLEX_SPI_IDR) TXFEF Interrupt Disable Mask */
#define FLEX_SPI_IDR_TXFEF(value)             (FLEX_SPI_IDR_TXFEF_Msk & ((value) << FLEX_SPI_IDR_TXFEF_Pos))
#define FLEX_SPI_IDR_TXFFF_Pos                _U_(25)                                              /**< (FLEX_SPI_IDR) TXFFF Interrupt Disable Position */
#define FLEX_SPI_IDR_TXFFF_Msk                (_U_(0x1) << FLEX_SPI_IDR_TXFFF_Pos)                 /**< (FLEX_SPI_IDR) TXFFF Interrupt Disable Mask */
#define FLEX_SPI_IDR_TXFFF(value)             (FLEX_SPI_IDR_TXFFF_Msk & ((value) << FLEX_SPI_IDR_TXFFF_Pos))
#define FLEX_SPI_IDR_TXFTHF_Pos               _U_(26)                                              /**< (FLEX_SPI_IDR) TXFTHF Interrupt Disable Position */
#define FLEX_SPI_IDR_TXFTHF_Msk               (_U_(0x1) << FLEX_SPI_IDR_TXFTHF_Pos)                /**< (FLEX_SPI_IDR) TXFTHF Interrupt Disable Mask */
#define FLEX_SPI_IDR_TXFTHF(value)            (FLEX_SPI_IDR_TXFTHF_Msk & ((value) << FLEX_SPI_IDR_TXFTHF_Pos))
#define FLEX_SPI_IDR_RXFEF_Pos                _U_(27)                                              /**< (FLEX_SPI_IDR) RXFEF Interrupt Disable Position */
#define FLEX_SPI_IDR_RXFEF_Msk                (_U_(0x1) << FLEX_SPI_IDR_RXFEF_Pos)                 /**< (FLEX_SPI_IDR) RXFEF Interrupt Disable Mask */
#define FLEX_SPI_IDR_RXFEF(value)             (FLEX_SPI_IDR_RXFEF_Msk & ((value) << FLEX_SPI_IDR_RXFEF_Pos))
#define FLEX_SPI_IDR_RXFFF_Pos                _U_(28)                                              /**< (FLEX_SPI_IDR) RXFFF Interrupt Disable Position */
#define FLEX_SPI_IDR_RXFFF_Msk                (_U_(0x1) << FLEX_SPI_IDR_RXFFF_Pos)                 /**< (FLEX_SPI_IDR) RXFFF Interrupt Disable Mask */
#define FLEX_SPI_IDR_RXFFF(value)             (FLEX_SPI_IDR_RXFFF_Msk & ((value) << FLEX_SPI_IDR_RXFFF_Pos))
#define FLEX_SPI_IDR_RXFTHF_Pos               _U_(29)                                              /**< (FLEX_SPI_IDR) RXFTHF Interrupt Disable Position */
#define FLEX_SPI_IDR_RXFTHF_Msk               (_U_(0x1) << FLEX_SPI_IDR_RXFTHF_Pos)                /**< (FLEX_SPI_IDR) RXFTHF Interrupt Disable Mask */
#define FLEX_SPI_IDR_RXFTHF(value)            (FLEX_SPI_IDR_RXFTHF_Msk & ((value) << FLEX_SPI_IDR_RXFTHF_Pos))
#define FLEX_SPI_IDR_TXFPTEF_Pos              _U_(30)                                              /**< (FLEX_SPI_IDR) TXFPTEF Interrupt Disable Position */
#define FLEX_SPI_IDR_TXFPTEF_Msk              (_U_(0x1) << FLEX_SPI_IDR_TXFPTEF_Pos)               /**< (FLEX_SPI_IDR) TXFPTEF Interrupt Disable Mask */
#define FLEX_SPI_IDR_TXFPTEF(value)           (FLEX_SPI_IDR_TXFPTEF_Msk & ((value) << FLEX_SPI_IDR_TXFPTEF_Pos))
#define FLEX_SPI_IDR_RXFPTEF_Pos              _U_(31)                                              /**< (FLEX_SPI_IDR) RXFPTEF Interrupt Disable Position */
#define FLEX_SPI_IDR_RXFPTEF_Msk              (_U_(0x1) << FLEX_SPI_IDR_RXFPTEF_Pos)               /**< (FLEX_SPI_IDR) RXFPTEF Interrupt Disable Mask */
#define FLEX_SPI_IDR_RXFPTEF(value)           (FLEX_SPI_IDR_RXFPTEF_Msk & ((value) << FLEX_SPI_IDR_RXFPTEF_Pos))
#define FLEX_SPI_IDR_Msk                      _U_(0xFF000F0F)                                      /**< (FLEX_SPI_IDR) Register Mask  */


